Centre for Computing and Information Services.txt|0|Centre for Computing and Information Services Centre for Computing and Information Services (CCIS) caters to the Computational and Information Technology (IT) related needs of the academic as well as 
Centre for Computing and Information Services.txt|1|Services Network Connectivity and Internet CCIS provides uninterrupted gigabit network connectivity to the entire campus including Academic Buildings, Student Hostels, Central Library, Administrative 
Centre for Computing and Information Services.txt|2|High-Performance Computing (HPC) Cluster The HPC facility installed in CCIS is used for the simulation of mathematical, physical and engineering problems. The main areas of applications are such as nu
Centre for Computing and Information Services.txt|3|Communication Devices EPABX Server Cisco BE6000H EPABX server with support of 1000 users with RAID 5 setting, 64 GB DDR4-2400 MHZ-RDIMM/PC4-19200/ Single rank/X4/1.2v 770W AC hot plug power supply for
Centre for Computing and Information Services.txt|4|Comsol Comsol software provides the foundation tools and solutions for data analysis, report generation and enterprise-wide information delivery. It can be used for virtually any application data, acc
Centre for Computing and Information Services.txt|5|Tecplot Tecplot is used for technical plotting and data processing. It performs the data visualization for the functions of one and two variables, parametric curves and representations in polar/spheri
Centre for Computing and Information Services.txt|6|ASPEN ASPEN is a process simulation software package widely used in industry and academia. Given a process design and an appropriate selection of thermodynamic models, Aspen uses mathematical models t
Centre for Computing and Information Services.txt|7|CMG CMG is used for reservoir simulation at the forefront in simulating new recovery methods and developing innovative ways to help you overcome existing technological barriers to reach your strategic