Combine Institute Policies.pdf|0|{iViiy "1i4i 45//n77 71911*177/i 17 [7i*I (raa $ afuf4 $ &ui7 pefqa 744 Tq TT Qi &re7) Rajiv Gandhi Institute of Petroleum Technology (An Institution of National Importance establlshed under an Act of
Combine Institute Policies.pdf|1|2. #TT #ife4r Rv-Fart 3. #4 gre #@ 4. DFit & Fiq #rofteniild grer %ietaivi 5. BF #TR 3r 3IRTARTG #a 6. 3Roftanilc} €1 fITYG #fa, 2025 7 . 37 fretu #RI # #iv & VRT & 71aA & fi 4olkh} @F4A, 2009 #Reitan
Combine Institute Policies.pdf|2|(JRAa) /32.3/2025 yrilf A< sif | Teiaaz an Dalte$ rofla % 4516144 dfrh 7r4m (aa $ &4f4H # &d7 rqd 7e14 Me7 61 W &rut) Rajiv Gandhi Institute of Petroleum Technology (An Institution of National Importa
Combine Institute Policies.pdf|3|necessary assistance to residents as and when required. Following policies are attached as Annexure-l with this notification: 1. Breach of Social Media Guidelines Disciplinary Actions 2. Social Media 
Combine Institute Policies.pdf|4|will be taken seriously and will be dealt with in accordance with the prevailing rules of the Institute. This notification supersedes all previous notifications issued on the above subjects. The guide
Combine Institute Policies.pdf|5|INTRODUCTION The Rajiv Gandhi Institute of Petroleum Technology (RGIPT), Jais, Amethi recognises the numerous benefits and opportunities that social media presents. The Institute actively uses social 
Combine Institute Policies.pdf|6|informality can encourage us to be less cautious than we would be using other more traditional methods of communication and interaction. WHAT IS SOCIAL MEDIA Social media in recent times has become sy
Combine Institute Policies.pdf|7|III. Blogging sites (e.g., Institute blogs, personal blogs or blogs hosted by media publications, Twitter) IV. Forums, discussion boards (e.g., Yahoo Groups, Google+, Google Groups), news article comm
Combine Institute Policies.pdf|8|Any individual suspected of committing a breach of the social media guidelines shall be required to cooperate with any investigation in accordance with the disciplinary procedure. Non-cooperation may 
Combine Institute Policies.pdf|9|it would make the student liable for further disciplinary action. Engage in any conduct which is unbecoming of a student at the Institute would make the student liable for disciplinary action. PROCEDU
Combine Institute Policies.pdf|10|only if there is verifiable evidence of wrongdoing against the student involved, otherwise the complaint shall be treated as closed. SCHEDULE OF PENALTIES To obviate any indiscretion by the students w
Combine Institute Policies.pdf|11|Posting content online giving the impression that 2 Appendix- I he/she is speaking on behalf of the Institute or the Department without proper permission from the competent authorities. Unauthorized r
Combine Institute Policies.pdf|12|group or entity or any other posting that constitutes, or contents may constitute, a criminal offence. posted online. Posting confidential information (which may include research not yet in the public
Combine Institute Policies.pdf|13|consent. (Related to the RGIPT community/system) Anything which may bring the Institute into disrepute or compromise the safety or reputation of fellow 8 students, alumni, faculty, staff and all other
Combine Institute Policies.pdf|14|POSSIBLE DISCIPLINARY ACTIONS The following is a representative list of corrective actions that may be taken depending upon the nature and severity of the social media guidelines breach. The list is n
Combine Institute Policies.pdf|15|certain events, activities, or class/lab; restricts specific campus student privileges as mentioned hereunder: i. Hostel Privileges ii. Use of Lab Facilities iii. Use of Library facilities iv. Use of 
Combine Institute Policies.pdf|16|Cybercrime branch or other relevant agencies. b. Academic and Research Restrictions/Suspension of Privilege: Prohibits participation in or attendance at certain events, activities, or class/lab; restr
Combine Institute Policies.pdf|17|result in suspension. The terms of disciplinary probation shall be determined on case- to-case basis. Suspension: Student will be withdrawn from all courses carried in that semester and forfeit fees. 
Combine Institute Policies.pdf|18|expulsion, forfeiture of right to study and fees. Student can visit the Institute premises only if the permission is issued in writing by Disciplinary Committee. Withholding award of degree: Withholdi
Combine Institute Policies.pdf|19|the appropriate use of social media when connected or linked in some way to their status as a student at the Institute, or when directly or indirectly referencing the Institute. b. These guidelines ap
Combine Institute Policies.pdf|20|publicly by others. There have been instances where offensive comments made on private messaging services such as WhatsApp, were captured and subsequently shared. Students should bear in mind that act
Combine Institute Policies.pdf|21|guidelines anytime they post material that could identify them or their relationship to the Institute. 2. Every Bonafide student of RGIPT should be mindful of the fact that information shared on socia
Combine Institute Policies.pdf|22|3. Any content inappropriately maligning RGIPT, its policies, employees and students should be avoided. 4. No student may claim to speak on behalf of, or represent, the Institute on social media websi
Combine Institute Policies.pdf|23|that they are posting in personal capacities. 5. Social media is now a common feature of everyday life, enabling and supporting both students and staff in academic and collaborative opportunities. Any
Combine Institute Policies.pdf|24|faculties and staff or post them in social media without their prior permission. 7. Students should be mindful of what they post online- social media tools are very public. What they contribute leaves
Combine Institute Policies.pdf|25|10. Civil and criminal laws apply to content posted online. Civil claims that could be brought include actions for defamation, harassment, breach of intellectual property rights, fraudulent misreprese
Combine Institute Policies.pdf|26|any license -for example, credit the author and/or link to the license, revealing trade secrets, violations of IPR et al will be viewed adversely and liable for legal action among other things. 12. Th
Combine Institute Policies.pdf|27|activities as part of their role, for example writing blogs or running an official Twitter account or any other social media account. Students should be aware that while contributing to the Institute'
Combine Institute Policies.pdf|28|students must not make ill-considered comments or judgement about other students, faculty, staff or third parties. The following non-exhaustive list is considered to be of an unacceptable nature and s
Combine Institute Policies.pdf|29|15.4 Comments posted using fake accounts, made-up names or using another person's name without their consent. 15.5 Inappropriate material, including images/morphed images, that is or may be perceived 
Combine Institute Policies.pdf|30|social media guidelines from time to time. Cyber bullying Cyber bullying includes, but not limited to the activities mentioned hereunder: a. Maliciously, negligently or recklessly spreading rumours, l
Combine Institute Policies.pdf|31|as perceived by those viewing the social media. e. Posting by Morphing/Animation/Photo editing and impersonality by visible contents and through Audio. f. Cyber bullying may also take place via other 
Combine Institute Policies.pdf|32|Undertaking An Undertaking to be submitted by all the students joining the Institute stating that they have understood what constitutes violation of social media guidelines and that the breach of guid
Combine Institute Policies.pdf|33|directions, Circulars, Notifications etc., and other penal provisions issued from time to time shall also apply. RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY (RGIPT) (An Institute of National Import
Combine Institute Policies.pdf|34|safe and secure place for learning and staying. ORGANIZATION: STRUCTURE AND FUNCTION Security Department – Structure, Reporting and Responsibilities The Security Department is the operational unit res
Combine Institute Policies.pdf|35|The department shall be responsible for: Ensuring the safety of faculty, staff, students, and visitors to the campus. b. Safety, security, and protection of institute property, including buildings, gr
Combine Institute Policies.pdf|36|the institute's internal safety, security, and integrity. This includes overseeing security policy, managing risk assessments, addressing incidents, ensuring protocol compliance, and coordinating with
Combine Institute Policies.pdf|37|of Students’ Affairs and Chairman, Council of Wardens in student-related matters. THE INTERNAL SECURITY COMMITTEE Internal Security Committee- Composition and Duties a. The Internal Security Committee
Combine Institute Policies.pdf|38|b. Plan and oversee security arrangements and escalate matters to the Chairman when necessary. 3 SECURITY OFFICER – BASIC DUTIES The Security Officer shall be responsible for ensuring the safety of in
Combine Institute Policies.pdf|39|g. Liaising with local police and district authorities on security matters. h. Responding to incidents such as natural disasters or fires. i. Coordinating with local administration and police as direc
Combine Institute Policies.pdf|40|f. Assist with crowd control during events and emergencies. g. Protect institutional property and prevent theft or vandalism. h. Enforce institute rules and regulations. i. Coordinate with authorities
Combine Institute Policies.pdf|41|4 2. Emergency Authority In emergencies where no designated authority is present, the senior-most faculty member on the site shall assume temporary responsibility until the appropriate authority arriv
Combine Institute Policies.pdf|42|institute, they are expected to exemplify proper conduct. SECURITY DEPARTMENT CODE OF CONDUCT AND DUTIES Security Officers must uphold the integrity of the Security Department and institute. Public di
Combine Institute Policies.pdf|43|REQUESTS AND COMPLAINTS All inquiries, complaints, or reports must be handled courteously and referred to the Chairman, Internal Security Committee before action, following proper procedures. UNIFORM 
Combine Institute Policies.pdf|44|d. Enforcement: Any attempt to bring alcohol or intoxicants onto campus must be reported up the chain of command. e. Political Activity: No political engagement is allowed while on duty or in uniform.
Combine Institute Policies.pdf|45|visible unless assigned to concealed duties. DUTY SCHEDULE AND FITNESS FOR DUTY Report for Duty: a. Security personnel must report on time, fully prepared, and in proper uniform, physically and mental
Combine Institute Policies.pdf|46|and throwing—will be conducted. Those who fail must improve or face removal from duty. c. The institute’s medical officer will conduct random health checks. 6 Unsatisfactory performance includes: a. L
Combine Institute Policies.pdf|47|Date & Time: When the incident occurred or was noticed Location: Precise spot (building, room, etc.) Description: Brief summary of the event and how it was discovered Persons Involved/Witnesses: Names
Combine Institute Policies.pdf|48|Internal Violations If any staff violates or is suspected to violate laws, rules, or directives, a written report must be submitted or handled confidentially to the Chairman, Internal Security Committ
Combine Institute Policies.pdf|49|at the discretion of the Chairman, Internal Security Committee. Key holders are responsible for their keys and must not lend them to others, including students or family members. MANDATORY SECURITY RE
Combine Institute Policies.pdf|50|d. Vehicle Passes & Driving Rules: Vehicle passes (2/4-wheeler) will be issued to faculty, staff, and PhD scholars upon submission of vehicle registration, license, and insurance. Unauthorized vehicle
Combine Institute Policies.pdf|51|managing all internal roadways and parking as per institute regulations. 8 RGIPT SECURITY PROTOCOLS- FOR STUDENTS S. Issue Security Department Role Protocol/Action Steps Remarks No. 1. Maintain a gate
Combine Institute Policies.pdf|52|intimation. - Regular patrols to 1. Register complaint in Lost & Found register. prevent theft. 2. Review CCTV footage if available. Loss of Personal - Register complaint and - Sensitise students to 3
Combine Institute Policies.pdf|53|Unauthorized 2. Stop and question unidentified persons. - Regular awareness for - Deny unauthorized access 3 Entry / 3. Inform Chairman Internal Security Committee. students to report and detain suspe
Combine Institute Policies.pdf|54|5. Preserve CCTV footage. S. Issue Security Department Role Protocol/Action Steps Remarks No. 1. Inform Chairman Internal Security Committee , Director, DoSA, and Admin. - Liaise with local law Studen
Combine Institute Policies.pdf|55|Calamity support emergency response every 6 months. 4. Ensure headcounts with hostel wardens. 5. File incident report. 1. Call institute ambulance/medical officer. 2. Inform Chairman Internal Security
Combine Institute Policies.pdf|56|8 Harassment initiate reporting protocol 3. Ensure complainant’s anonymity and safety. on anti-ragging. Complaints 4. Submit security report with evidence (CCTV, witnesses) if required to Chairman Int
Combine Institute Policies.pdf|57|Cultural, Sports, 2. Screen entry at venues. - Temporary passes for Ensure crowd control and 10 Science & Tech 3. Monitor crowd and respond to conflicts. outside participants event safety Events 4. Co
Combine Institute Policies.pdf|58|campus gates vendors/visitors. letter if required. 4. Deny access without valid credentials. 1. Inform Chairman Internal Security Committee, Log complaint and inspect the site. - Respond promptly, sec
Combine Institute Policies.pdf|59|rules on campus roads 3. Impose warning/fines for repeated violations. service vehicles. 4. No vehicle will be allowed without RGIPT pass. 1. Activate fire alarm and inform fire brigade. 2. Evacuate t
Combine Institute Policies.pdf|60|Casualties in Residential 5 response and family RGIPT administration. contact database for all Area (Injury/Death) coordination 3. In case of death, secure area, notify police, and residents. preserve
Combine Institute Policies.pdf|61|5. Record incident and follow-up action taken. 1. Reach the spot immediately and assess the situation. Accidents within - Provide immediate 2. Call medical aid and provide basic support. - Regular pat
Combine Institute Policies.pdf|62|5. Report suspicious behaviour to Chairman Internal Security Committee and Registrar 1. Confirm with resident over phone. - Allow entry after 2. Record visitor details in logbook. - No overnight stay 
Combine Institute Policies.pdf|63|Entry/Exit at Campus Verify, allow only by Security Department/ Contractor. No verbal permissions 1 Gates authorized personnel 2. Maintain entry and exit register. allowed. 3. No entry without proper 
Combine Institute Policies.pdf|64|Age Verification (Child Prevent illegal 2. Check ID proof at time of issuing pass. Mandatory under child 3 Labour) employment practices 3. Report any underage labour to Chairman Internal labour laws. 
Combine Institute Policies.pdf|65|No. Role 1. Separate individuals and ensure safety. 2. Inform Chairman Internal Security and IWD and Fights / Violence among concerned contractor. Maintain discipline in 5 Intervene and report Laboure
Combine Institute Policies.pdf|66|1. Thoroughly check bags/tools on exit. 2. If theft suspected, detain and inform Chairman Item Theft / Suspicion of Frequent offenders must Internal Security 7 Prevent and investigate Theft be blackli
Combine Institute Policies.pdf|67|Cultural, Sports, Science & Facilitate support role Passes to be surrendered 1. Verify vendor support list from Event Coordinator. 9 Tech Events (Support Staff under supervision post-event. 2. Allow t
Combine Institute Policies.pdf|68|1. Alert emergency services immediately. 2. Evacuate area and inform Chairman Internal Emergency Situations (Fire, Ensure safety and rapid Security/ Medical/ IWD/ Concerned Contractor. Safety briefing
Combine Institute Policies.pdf|69|1. Verify with work schedule or delivery note. 2. Log vehicle number, driver name, purpose, time in/ Check, record, and Outsourced Vendor Vehicle out. Parking zones to be 13 regulate vehicle Entry 3. 
Combine Institute Policies.pdf|70|social media and other modes of communication. 2. Definition of Student Misconduct A. Misconduct includes, but is not limited to: • Disruption of academic or administrative activities. • Harassment in
Combine Institute Policies.pdf|71|similar substances. • Language or behavior disrespecting individuals or insulting the modesty of women. • Any form of sexual harassment. • Involvement in ragging or related activities. • Theft, fraud,
Combine Institute Policies.pdf|72|• Breach of security protocols or non-cooperation during inspections. • Provoking communal, caste-based, or regional disharmony. • Repeated offenses despite previous disciplinary actions. • Violation 
Combine Institute Policies.pdf|73|• Standing Disciplinary Committee – Appointed by the Director for routine and investigative functions. C. Definitions: Terms not defined in this policy but defined in other RGIPT rules or applicable l
Combine Institute Policies.pdf|74|• Fine – ₹1,000 to ₹5,000. B. Major Misconduct • Suspension of Privileges: o Removal from hostel. o Disqualification from positions of responsibility. o Restricted access to labs, sports, and library.
Combine Institute Policies.pdf|75|• Withholding/Withdrawal of Degree: Based on severity of misconduct. • Referral to External Authorities: Institute may refer cases to police or legal bodies without prejudice to internal disciplinary 
Combine Institute Policies.pdf|76|Affairs to the Standing Disciplinary Committee. 2. Inquiry: The Committee shall conduct an inquiry, ensuring adherence to principles of natural justice. Both complainant and respondents will be given 
Combine Institute Policies.pdf|77|and recommendations to the Approving Authority. 6. Final Order: Approving Authority shall issue a reasoned order based on the Committee’s report. If an Approving Authority does not accept the recommen
Combine Institute Policies.pdf|78|Disciplinary Committee (ADC) comprising: i. Dean (SA) ii. Dean (AA) iii. Dean (R&D) iv. SGRC Chairperson v. Respective HoD(s) 4. The Dean (SA) convenes the ADC meeting. 5. ADC and SDC recommendations 
Combine Institute Policies.pdf|79|of India (hereinafter referred to as the “the Act”). Accordingly, while the policy covers all the key aspects of the Act, for any further clarification reference shall always be made to the Act and th
Combine Institute Policies.pdf|80|Transport, Exam Committee, Women Cell/ICC, etc.), students often face confusion about where to raise their concerns. This policy provides a centralized and structured platform through which students c
Combine Institute Policies.pdf|81|d) To ensure that the views of each complainant and respondent are respected and that any party to a grievance is neither discriminated against nor victimized and; e) To ensure that there is a consist
Combine Institute Policies.pdf|82|b) A ‘Student’ for the purpose of these regulations shall mean a student enrolled for a full-time programme of the Institute 6. Definitions: a) Grievance: means a formal complaint that includes any ki
Combine Institute Policies.pdf|83|7. Types of grievance: a) Academic Related: Admissions, Conduct of classes, Examination Assessments, Evaluation, Library Facilities, Issuance of Certificates, Add-on courses, Research Related issues, 
Combine Institute Policies.pdf|84|e) General Administration: Collection of fees, ID cards, Scholarships Disbursement, Transportation, etc. f) Hostel Facilities: Complaints regarding provisions/ food services, Safety and security of on
Combine Institute Policies.pdf|85|Redressal Committee for consideration and disposal: a) Decisions of the BOG/Senate of the RGIPT b) Complaints involving policy matters in which the grievant has not been affected directly/ indirectly.
Combine Institute Policies.pdf|86|• and depositing it in the official grievance box located at the hostel office. Email (chair_sgrc@rgipt.ac.in) communication to designated grievance • officers. 9. Required Information: Full name and 
Combine Institute Policies.pdf|87|directly by coordinating with the concerned authority or committee. Upon resolution, the SGRC shall update the status to the grievant. iii. If deemed necessary, the Student Grievance Redressal Chairma
Combine Institute Policies.pdf|88|may be sought by written or verbal request or by face-to face interview with the complainant. v. Wherever required, the Institute will take preventive or corrective action in a reasonable time and adv
Combine Institute Policies.pdf|89|of the actions taken as part of the process will be provided if so, requested by the complainant or the respondent. d) While dealing with the issue, all possible confidentiality and privacy will be ma
Combine Institute Policies.pdf|90|with the following composition, namely: a) A Professor- Chairperson b) Two Professors of the Institution as Members. c) Five (3 B.Tech + 1 Ph.D. + 1 MTech/MBA.) representative from among students to b
Combine Institute Policies.pdf|91|natural justice. vii. The SGRC shall send its report with recommendations, if any, to the Competent Authority of the institution concerned and a copy thereof to the aggrieved student. viii. Any studen
Combine Institute Policies.pdf|92|incorporate feedback received from the stakeholders through impact analysis and deliberations of the Focus Group. UGC REGULATION ON CURBING THE MENACE OF RAGGING IN HIGHER EDUCATIONAL INSTITUTIONS, 20
Combine Institute Policies.pdf|93|1.3. They shall apply to all the universities established or incorporated by or under a Central Act, a Provincial Act or a State Act, to all institutions deemed to be university under Section 3 of the
Combine Institute Policies.pdf|94|institutions in the country by prohibiting it by law, preventing its occurrence by following the provisions of these Regulations and punishing those who indulge in ragging as provided for in these Reg
Combine Institute Policies.pdf|95|students undergoing such programme of study for the examination for the award of such qualification. 3.2. "Head of the institution" means the 'Vice-Chancellor' in case of a university/deemed to be uni
Combine Institute Policies.pdf|96|effect of teasing, treating or handling with rudeness any other student, indulging in rowdy or undisciplined activities which causes or is likely to cause annoyance, hardship or psychological harm or 
Combine Institute Policies.pdf|97|11 standards in the relevant areas of higher education, such as the All India Council for Technical Education (AICTE), the Bar Council of India (BC!), the Dental Council of India (DCI), the Distance E
Combine Institute Policies.pdf|98|institution specially empowered by an Act of Parliament to confer or grant degrees. 4. Punishable ingredients of Ragging:- • Abetment to ragging; • Criminal conspiracy to rag; • Unlawful assembly and 
Combine Institute Policies.pdf|99|• Physical or psychological humiliation; • All other offences following from the definition of"Ragging". 5. Measures for prohibition of ragging at the institution level:- 5.1 The institution shall str
Combine Institute Policies.pdf|100|residential, sports, canteen, etc) whether located within the campus or outside and in all means of transportation of students whether public or private. 5.3 The institution shall take strict action a
Combine Institute Policies.pdf|101|block letters these Regulations in full (including Annexures). 6.1.3 The 'Prospectus' and other admission related documents shall incorporate all directions of the Supreme Court and /or the Central or
Combine Institute Policies.pdf|102|languages known to the institution and the applicant (English version given in Annexure I, Part I), to be filled up and signed by the candidate to the effect that he/she is aware of the law regarding 
Combine Institute Policies.pdf|103|I, Part II), to be signed by the parent/ guardian of the applicant to the effect that he/ she is also aware of the law in this regard and agrees to abide by the punishment meted out to his/ her ward i
Combine Institute Policies.pdf|104|additional undertaking in the form of Annexure I (both Parts) along with his/ her application for hostel accommodation. 6.1.8 At the commencement of the academic session the Head of the Institution sh
Combine Institute Policies.pdf|105|those indulging in ragging, big posters (preferably multicolored with different colours for the provisions of law, punishments, etc.) shall be prominently displayed on all Notice Boards of all departm
Combine Institute Policies.pdf|106|locations. 6.1.12 The institution shall tighten security in its premises, especially at the vulnerable places. If necessary, intense policing shall be resorted to at such points at odd hours during th
Combine Institute Policies.pdf|107|beginning of the academic year with a clear sense of the main aims and objectives of the induction process. 6.2 On admission:- 6.2.1 Every fresh student admitted to the institution shall be given a pr
Combine Institute Policies.pdf|108|reduce the freshers' dependence on their seniors. 6.2.2 The institution through the leaflet mentioned above shall explain to the new entrants the arrangements for their induction and orientation which
Combine Institute Policies.pdf|109|6.2.4 The leaflet mentioned above shall contain a calendar of events and activities laid down by the institution to facilitate and complement familiarization of freshers with the academic environment 
Combine Institute Policies.pdf|110|regarding ragging and the punishments, and appealing to them to impress upon their wards to desist from indulging in ragging when they come back at the beginning of the next academic session. 6.3.2 At
Combine Institute Policies.pdf|111|headed by the Head of the institution and shall consist of representatives of faculty members, parents, students belonging to the freshers' category as well as seniors and non-teaching staff. It shall
Combine Institute Policies.pdf|112|shall be kept mobile, alert and active at all times and shall be empowered to inspect places of potential ragging and make surprise raids on hostels and other hot spots. The Squad shall investigate in
Combine Institute Policies.pdf|113|orientation programmes, counseling sessions, etc., and regarding the incidents of ragging, the problems faced by wardens and other officials, etc. This Cell shall also review the efforts made by such 
Combine Institute Policies.pdf|114|Regulations shall be furnished at the beginning of each academic year by every student, that is, by freshers as well as semors. 6.5.2 The institution shall arrange for regular and periodic psychologic
Combine Institute Policies.pdf|115|ragging by means of audio-visual aids, by holding counseling sessions, workshops, painting and design competitions among students and other methods as it deems fit. 6.5.4 If the institution has B.Ed. 
Combine Institute Policies.pdf|116|well as the softer skills of counseling and communicating with the youth outside the class-room situations. Wardens shall be accessible at all hours and shall be provided with mobile phones. The insti
Combine Institute Policies.pdf|117|administration and the institutional authorities shall ensure vigil on incidents that may come within the defmition of ragging and shall be responsible for action in the event of ragging in such premi
Combine Institute Policies.pdf|118|6.5.10 Anonymous random surveys shall be conducted across the Ist year batch of freshers every fortnight during the first three months of the academic year to verify and cross-check whether the campus
Combine Institute Policies.pdf|119|Remedial action shall be initiated and completed within the one week of the incident itself 6.5.13 The Migration / Transfer Certificate issued to the student by the institution shall have an entry, ap
Combine Institute Policies.pdf|120|not merely that of the specific body/ committee constituted for prevention of raggmg. 6.5.I5 The Heads of institutions other than universities shall submit weekly reports to the Vice-chancellor of the
Combine Institute Policies.pdf|121|campuses, except in class-rooms, seminar halls, library etc. where jammers shall be installed to restrict the use of mobile phones. 6.6 Measures for encouraging healthy interaction between fresher’s a
Combine Institute Policies.pdf|122|introduction to one another and where the talents of the freshers are brought out properly in the presence of the faculty, thus helping them to shed their inferiority complex, if any, and remove their
Combine Institute Policies.pdf|123|7. Measures at the UGC/ Statutory/ Regulatory body level:- 7.1 Regulatory measures:- 7.1.1 The UGC and other Statutory /Regulatory bodies shall make it mandatory for the institutions to compulsorily i
Combine Institute Policies.pdf|124|bodies shall cross-verify that the institutions strictly comply with the requirement of getting the undertakings from the students and their parents/ guardians as envisaged under these Regulations. 7.
Combine Institute Policies.pdf|125|in the institution while assessing the institution in different grades. 7.2 Incentives for curbing ragging: - 7.2.1 The UGC shall consider providing special/ additional annual financial grants- in-aid
Combine Institute Policies.pdf|126|incumbents. 7.3 Monitoring mechanism to ensure compliance: - Apart from the monitoring mechanism built in under different sub-clauses of these Regulations, there shall also be the following monitoring
Combine Institute Policies.pdf|127|7.3.2 The UGC shall also have an Anti-Ragging Cell within the Commission as an institutional mechanism to provide secretarial support for collection of information and monitoring, and to coordinate wi
Combine Institute Policies.pdf|128|8.1.2 Withholding/ withdrawing scholarship/ fellowship and other benefits 8.1.3 Debarring from appearing in any test/ examination or other evaluation process 8.1.4 Withholding results 8.1.5 Debarring 
Combine Institute Policies.pdf|129|8.1.1 I Collective punishment: When the persons committing or abetting the crime of ragging are not identified, the institution shall resort to collective punishment. 8.2 At the university level in re
Combine Institute Policies.pdf|130|programme of study therein for the award of any degree/diploma of the university 8.2.3 Withholding grants allocated to it by the university, if any 8.2.4 Withholding any grants chanellised through the
Combine Institute Policies.pdf|131|shall, in its turn, take prompt and appropriate action against the Head. 8.4 At the UGC/Statutory/Regulatory body level:- If an institution fails to curb ragging, the UGC/Statutory/Regulatory body con
Combine Institute Policies.pdf|132|Regulatory body concerned 8.4.4 Declaring that the institution does not have the minimum academic standards and warning the potential candidates for admission accordingly through public notice and pos
Combine Institute Policies.pdf|133|prohibiting ragging and the directions of the Supreme Court and the Central/State Government in this regard. 2. I have received a copy of the UGC Regulations on Curbing the Menace of Ragging in Higher
Combine Institute Policies.pdf|134|force. 5. I hereby affrrm that I have not been expelled or debarred from admission by any institution. Signed this day of month of Year Signature Name: Address: 20 ANNEXURE I, Part II UNDERTAKING BY P
Combine Institute Policies.pdf|135|punished as per the provisions of the UGC Regulations mentioned above and/or as per the law in force. Signed this ----------------------------------------- day of month of Year Signature Name: Address