hostelregulations.pdf|0|HOSTEL OFFICE HOSTEL RULES & REGULATIONS HOSTEL ACCOMMODATION Rajiv Gandhi Institute of Petroleum Technology, Jais, Amethi is a fully residential Institute and all registered students are required to 
hostelregulations.pdf|1|sockets for using laptops and charging cell phones. Stay in the hostel is governed by a set of rules given below: 1. Ragging - Ragging is a cognizable offense (offense for which the police can arrest 
hostelregulations.pdf|2|Students should pay their fees towards hostel and messing charges timely. 4. Use of intoxicants -Smoking, consumption of alcoholic drinks/ intoxicants/ drugs inside or outside the hostel premises is s
hostelregulations.pdf|3|same disciplinary action will be taken. 7. Maintenance and upkeep – a) Maintenance of hostel property is the collective responsibility of the residents of the hostel. If a room is damaged or its furni
hostelregulations.pdf|4|students who have found spoiling the hostel property by any means will be forfeited. d) Every student shall keep the room allotted to him neat and clean. He/she shall take proper care of the furniture
hostelregulations.pdf|5|f) Students must pay all dues and hand over the charges of rooms and other materials in satisfactory condition before relinquishing the hostel. g) Students should not drive nails. Screws etc. In to th
hostelregulations.pdf|6|behavior/noisy) form the neighbors/society will result in sever action. b) No nuisance of any kind shall be made at any time in the hostel premises, like playing loud music/games etc. 9. Resident Prop
hostelregulations.pdf|7|the hostel. The decision of the Warden in this regard will be final and binding. c) Transportation facility in medical case will be provided only when referred by the institute doctor/consultant. 11. 
hostelregulations.pdf|8|attract penalty. However, students who have to stay back for genuine reason will be permitted only on getting written permission from the concerned faculty supervisor or any other official and submitt
hostelregulations.pdf|9|permission of the Hostel Warden, RGIPT. b) Resident students are not permitted to convene any meeting of any sort under any circumstances anywhere in the hostel premises without the prior permission o
hostelregulations.pdf|10|b) If any student is found misbehaving and misconducting himself, he/she will be liable for disciplinary action including being expelled from the hostel immediately and the fees paid by him/her will b
hostelregulations.pdf|11|exceptional circumstances a resident may be reassigned a room, in the best interest of all residents. 19. Tampering - Any tampering with the network devices and other electronic devices installed in h
hostelregulations.pdf|12|weapon with them in the Hostel premises even though possessing a license for it. 22. Mess Timings - Students are required to observe the mess timings religiously. They will be denied entry and food be
hostelregulations.pdf|13|permitted in the hostel, if used by students, they shall be discontinued without given any notice and disciplinary action will be taken against the student involved. b) No student shall use the servic
hostelregulations.pdf|14|agree to abide them and any other rules and regulations of the Hostel which may be introduce from time to time. I am liable for strict disciplinary action in case of any breach. ----------------------
hostelregulations.pdf|15|comes under indiscipline. If he/she is found to be involved/indulged in any such activities, then as per University norms, the disciplinary action will be taken against him/her. 3. In case of the medi
hostelregulations.pdf|16|the intimation of any medical issue related to my son/daughter. If I don’t attend my son/daughter without assigning cogent reasons, I will be fully responsible for his/her health condition/consequence
hostelregulations.pdf|17|weekends when he/she will go out from the hostel for academic/non-academic purposes as well as whenever he/she will be visiting home. I assure that in both cases, he/she will maintain hostel timings. 
hostelregulations.pdf|18|declare that: 1. All the filled entries are correct & true. 2. I am not suffering from any serious/communicable/infectious disease. 3. I shall abide by the rules and regulations of the hostel from tim
hostelregulations.pdf|19|examination. I also declare that I have never been devoid/rusticated/expelled by any University/Institution for being indulging in any unwanted/unlawful activity. 8. I shall pay the Accommodation char
hostelregulations.pdf|20|hostel and will be responsible for any action taken by Institute authority and that will be binding on me. 11. I shall never indulge myself directly or indirectly in any type of ragging activity. 12. 