InformationBrochure_BTech.pdf|0|I B nformatIon rochure B.Tech. Admission 2020-21 RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY (An Institution of National Importance established by the Government of India) Jais, Amethi, Uttar Prade
InformationBrochure_BTech.pdf|1|4.6 Application Fee 8 4.7 Application Process 8-11 4.8 Fee Structure 11-12 4.9 Admission Office 12 5 Hostel 12 5.1 Health facilities 13 6 Co-Curricular & Extra-Curricular Activities 13 6.1 Sports Coun
InformationBrochure_BTech.pdf|2|that you have taken an apt career decision. The Institute is currently undertaking the leap of transition. This is an exciting period to get associated and leave your footprint on the anticipated rema
InformationBrochure_BTech.pdf|3|of new academic session with renewed vigor and enthusiasm with a brand new set of project based course curriculums for all the UG and PG programmes. The first ranking of 134th in the NIRF assessment d
InformationBrochure_BTech.pdf|4|rigors of the Institute and evolve with flying colors to set your unmissable mark at the world stage in future. A.S.K. Sinha Director, RGIPT INFORMATION BROCHURE 1. About RGIPT Rajiv Gandhi Institute 
InformationBrochure_BTech.pdf|5|HPCL) in association with the Oil Industry Development Board (OIDB). The Institute is associated with leading international universities and institutions specializing in the domain of Petroleum & Ener
InformationBrochure_BTech.pdf|6|humanities, engineering and management are also offered at the Institute. RGIPT Jais Campus The B.Tech. programmes of the Institute are aimed at developing manpower with sound theoretical and experime
InformationBrochure_BTech.pdf|7|problems among students. These programmes seek to develop manpower of the highest quality to cater to the needs of industry, R & D organizations and academic institutions. The Institute received a ran
InformationBrochure_BTech.pdf|8|With a view to supplement its on-campus academic offerings, the RGIPT has established two centres at Sivasagar, Assam and Bengaluru, Karnataka. Assam Energy Institute, the centre of RGIPT at Sivasagar
InformationBrochure_BTech.pdf|9|2 B.Tech. Admission 2020-21 INFORMATION BROCHURE 2. Training & Placement Engineering and Technology is the backbone of the development of the society. Living, health and economic standards of the peop
InformationBrochure_BTech.pdf|10|students. UG degree holders in engineering and technology are directly employed by a number of reputed Industries through campus placement drive. RGIPT boasts of placement of its students with handsom
InformationBrochure_BTech.pdf|11|of 2020 in Chemical Engineering and Petroleum Engineering discipline. The list of recruiters includes ONGC, OIL, Torrent Gas, Wipro, HMEL, Reliance, Pie Infocomm, BORL, HPCL, IOCL, IOAGPL etc. A large
InformationBrochure_BTech.pdf|12|graduates.  B.Tech. in Computer Science and Engineering (Intake 60)  B.Tech. in Electronics Engineering (Intake 60)  IDD in Petroleum Engineering (Intake 20)  IDD in Chemical Engineering (Intake 2
InformationBrochure_BTech.pdf|13|campus. The campus offers several facilities to its residents, namely the Bank and ATM facility (Bank of Baroda), Post Office, Cafeteria, Stationary, Grocery Stores, Gymnasium, Health Centre, Ambulanc
InformationBrochure_BTech.pdf|14|institute, RGIPT puts sufficient emphasis on encouraging technical creativity among the students and faculty members. Design and Innovation Center (DIC) is an initiative aimed at keeping the technical
InformationBrochure_BTech.pdf|15| Extended Projects/B.Tech. Projects 3.2 Library The RGIPT central library is fully computerized with a large and ever growing collection of books. Currently, more than 8000 books covering engineering
InformationBrochure_BTech.pdf|16|Society (ACS), One Petro, SEG, AAPG etc. 3.3 Central Research facilities World-class teaching Institutions across the globe essentially boast of State-of-the-Art research environment as both teaching 
InformationBrochure_BTech.pdf|17|frontier areas of Energy and Petroleum at RGIPT & its centres and also help nearby academic & R&D organizations and industries through offering technical and consultancy services. 4 B.Tech. Admission 
InformationBrochure_BTech.pdf|18|and Kode Club were showcased. Additionally, workshops on Computational Fluid Dynamics and Data Science were conducted by professionals from Skyfi Labs to introduce the students to the nuances of moder
InformationBrochure_BTech.pdf|19|mentorship of faculty members of the Institute and industrial experts. The Institute regularly explores possibilities to tie up with industries so that the students will be provided with joint mentors
InformationBrochure_BTech.pdf|20|RGIPT is deeply committed towards providing a safe and comfortable environment for its girl students in the campus. The Women cell of the institute has been active since 2016 and regularly organizes s
InformationBrochure_BTech.pdf|21|Institute website to gain further details on the woman safety and campus life of girl students. 5 B.Tech. Admission 2020-21 INFORMATION BROCHURE 4. Admission Engineering education requires expert know
InformationBrochure_BTech.pdf|22|business aptitude in students. 4.1 B.Tech. & IDD Programmes offered in 2020-21 Academic Session The Institute offers admission in 4-year B.Tech. and 5-year IDD programmes in the following disciplines 
InformationBrochure_BTech.pdf|23|Petroleum Engineering 75 30 8 20 11 6 15 Chemical Engineering 75 30 8 20 11 6 10 Computer Science and 60 24 6 16 9 5 12 Engineering Electronics Engineering 60 24 6 16 9 5 12 IDD Petroleum Engineering 
InformationBrochure_BTech.pdf|24| RGIPT does not offer preparatory courses and hence preparatory rank will not be considered.  Candidates having color blindness are not eligible for B.Tech. in Petroleum Engineering. They may howeve
InformationBrochure_BTech.pdf|25|The candidate seeking admission in B.Tech. (Petroleum Engineering/Chemical Engineering/Computer Science and Engineering/Electronics Engineering) must have secured at least 75% aggregate marks or CPI o
InformationBrochure_BTech.pdf|26|Candidates seeking admission in B.Tech. (Petroleum Engineering/Chemical Engineering) should be 24 years of age or lower at the time of application for the UG programme and in countries where a minimum
InformationBrochure_BTech.pdf|27|Following the GOI directive and to encourage technical education among the girls, 17% of the seats will be reserved for female candidates on supernumerary basis over the current strength. The Certific
InformationBrochure_BTech.pdf|28|Declaration of first round provisional list of shortlisted November 25, 2020 (Wednesday) candidates Last date for acceptance of Registration Fee B.Tech. & IDD: December 01, 2020 (Tuesday) (General/ OB
InformationBrochure_BTech.pdf|29|Payment of remaining amount for selected candidates in December 18, 2020 (Friday), up second round to 6:00 PM* Declaration of third round of selected candidates who paid December 20, 2020 (Sunday), re
InformationBrochure_BTech.pdf|30|* N ote: The candidates those wish to withdraw their applications and release their seats, shall send the written request before the last date of deposition of remaining semester fee of the respective
InformationBrochure_BTech.pdf|31|Interested candidates should submit their application online before the stipulated deadline as mentioned in the Table 2. It may be noted that candidates from Assam, Meghalaya, Jammu & Kashmir are exem
InformationBrochure_BTech.pdf|32|1. Choose B Tech Programme and click [Proceed for Registration]. 2. Now you are in Registration page. 3. Fill all the details carefully Name of Applicant, Date of Birth, Category, Mobile Number and Em
InformationBrochure_BTech.pdf|33|and email ID. 8 B.Tech. Admission 2020-21 INFORMATION BROCHURE Step-2 Procedure to Login 1. Enter your login credentials received through SMS and/or Email to login into the Online Admission Applicatio
InformationBrochure_BTech.pdf|34|2. You will be redirected to Fee Payment page. Pay the prescribed fees using Debit Card/Credit Card/Net Banking/UPI. The stipulated application fee to be paid is given in the Clause 4.6 for reference.
InformationBrochure_BTech.pdf|35|2. Select choice of preference of disciplines. 3. Fill your details like Father’s Name, Mother’s Name, Caste Certificate Number, Nationality etc. 4. After filling all the details correctly click on Sa
InformationBrochure_BTech.pdf|36|details of Permanent Address. 4. After filling all the details correctly click on Save & Continue button. 5. You will receive a Pop-Up Message of successful submission of Address & Contact Details. Cl
InformationBrochure_BTech.pdf|37|4. You will receive a Pop-Up Message of successful submission of details. Click on OK button to proceed further. Step-7 Procedure to Fill IIT JEE (Advanced) Details 1. After successful submission of A
InformationBrochure_BTech.pdf|38|Details Page. 2. Fill your details like Name of Account Holder,Name of Bank,Account Number, IFSC Code,PAN. 3. After filling all the details correctly click on Save & Continue button. 4. You will recei
InformationBrochure_BTech.pdf|39|1. After successfully uploading the documents applicant will be redirected to Review Application Page. 2. In case you wish to make any change in the form you can click on Edit button of that particula
InformationBrochure_BTech.pdf|40|appear after final submission of application. Note: No changes will be allowed after Final Submission of form; hence applicants are advised to make required changes if any while reviewing the applicat
InformationBrochure_BTech.pdf|41|4. The selected list of candidates for subsequent rounds shall be published based on the availability of seats. 5. All the above activities will be carried out following a strict timeline as mentioned
InformationBrochure_BTech.pdf|42|Fee 3 Student’s Welfare Fund 1,000.00 1,000.00 1,000.00 1,000.00 4 Thesis --- --- 1,000.00 1,000.00 Total 6,000.00 6,000.00 7,000.00 7,000.00 B. DEPOSITS PAYABLE AT THE TIME OF ADMISSION (REFUNDABLE) 
InformationBrochure_BTech.pdf|43|7 Medical Fee 300.00 300.00 300.00 300.00 Total 1,08,300.00 8,300.00 1,08,300.00 8,300.00 AMOUNT PAYABLE AS INSTITUTE’S DUES AT THE TIME OF ADMISSION (FIRST SEMESTER) 8 TOTAL OF ‘A’, ‘B’ & ‘C’ 1,23,30
InformationBrochure_BTech.pdf|44| For SC/ST/PwD categories: Rs. 8300.00 (B.Tech. programmes)  For GEN/OBC/EWS categories: Rs. 99300.00 (IDD programmes)  For SC/ST/PwD categories: Rs. 9300.00 (IDD programmes) 11 B.Tech. Admission 2
InformationBrochure_BTech.pdf|45|semester, which will be adjusted towards actual bills at the end of each academic year. 4.9 Admission Office Third Floor, Administrative Block Rajiv Gandhi Institute of Petroleum Technology Bahadurpur
InformationBrochure_BTech.pdf|46|verification process is over. 5. Hostel Being a residential Institution, it is compulsory for all students to reside in the campus during their programmes. RGIPT provides separate hostel facilities fo
InformationBrochure_BTech.pdf|47| Hostel rooms are designed to provide adequate moving space and proper ventilation.  Rooms are furnished with bed, study table, chair, partitioned almirah, fan, fluorescent tubes. 12 B.Tech. Admissi
InformationBrochure_BTech.pdf|48|headed by a faculty member. The mess starts in the morning with breakfast (8.00 am -9.30 am) followed by lunch (12.30 pm -2.00 pm), snacks (5.30 pm-6.30 pm) and then dinner is served between 8.15 pm –
InformationBrochure_BTech.pdf|49|a pharmacist and a nurse are available on a full-time basis to provide emergency first-aid, and for routine medical services. The health centre has a large verity of medicines available, which is read
InformationBrochure_BTech.pdf|50|6. Co-Curricular & Extra-Curricular Activities 6.1 Sports Council Games and sports are crucial for holistic development of students. It promotes health and the spirit of healthy competition between st
InformationBrochure_BTech.pdf|51|Inter-Collegiate and Intramural Sports events. Recently, the Institute organized Mini-marathon to commemorate the birth anniversary of Sardar Vallabhbhai Patel, the Iron Man of India. RGIPT also offer
InformationBrochure_BTech.pdf|52|government schools. On the occasion of Republic Day, every year ARPAN organizes a science fair. As a part of the Community Service Program or Sauhardya, students are actively engaged in promoting heal
InformationBrochure_BTech.pdf|53|Council organizes events like Kaltarang-Annual Cultural Festival, Pratidhwani-The Freshers’ Night and celebrates festivities like the Garbha night, Deepavali, Eid, Christmas, etc. In an attempt to pro
InformationBrochure_BTech.pdf|54| From Rae Bareli Railway Station to RGIPT [Click Here]  From Jais Railway Station to RGIPT [Click Here]  List of Trains passing Via Jais [Click Here] Bus/Transport Service for RGIPT, Jais, Amethi B
InformationBrochure_BTech.pdf|55| Preet Hotel  Rahi Tourist Bunglow  Laxmi Hotel  Om Clarks Inn  Surya Hotel 15 B.Tech. Admission 2020-21 Important Links ► About RGIPT [Link] ► About Director [Link] ► About Academics [Link] ► Ab