Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|0|roila @i Je1fH #uiflan &runtt (dva & afuf145 & 3il- relfqa 7544 Terd E1 0G &reTv) Rajiv Gandhi Institute of Petroleum Technology (An Institution of National Importance established under an Act of Parl
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|1|be followed for the deposition of the academic mess advance and registration. IMPORTANT INSTRUCTIONS The students must deposit the academic fees and mess advance latest by Thursday, July 2025. Your ph
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|2|of Students who have their full fee. will only be allowed to enter the campus premises. 3) After submission of semester fee and mess advance. the student must register online for the Odd Semester, 202
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|3|before the of registration, i.e by_Sunday 27th_July 2025: Note_that__your registration_ in Odd Semester will be CQmpleted only when You do the physical registration: mN l1k5 25th fee; 27th paid paid d
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|4|failing_to do so will be_treated as QOU-registered 7) A non-registered student shallnot beallowed_to attend classes_ willbe marked abseut_during the_period of non-registration No relaxation in_atteuda
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|5|obtaining the approval of the Chairman-Senate on the recommendation of DUGC and HoD of the respective department, on justified ground and on the payment of such late fine as decided by the competent a
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|6|as advised by DUGC  during physical registration. For Overload courses (if any). the requirement of attendance shall be same aS other regular courses. 12) If the student is opting for any backlog cour
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|7|(dva & afuf144 & &47 refqa 7e4 %emt #1 [ &reTv) Rajiv Gandhi Institute of Petroleum Technology (An Institution of National Importance established under an Act of Parliament) Jais, Amethi- 229304, UP; 
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|8|SD, EC,EV,MS,ME, IDD Note: Merit cum Means Scholarship awardee shall (2024-2029) - 3rd Semester) pay the full fees, and the Scholarship Amount shall be reimbursed in the month of September-2025. 1. GE
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|9|Semester) pay the full fees, and the Scholarship Amount shall be reimbursed in the month of September-2025. Mess Advance: Rs. 20,000.00 for each student Minor Programme: Rs. 10,000.00 those students e
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|10|registered Institute s e-mail Id and Mobile No from eazypay@icicibank.com by 05.00 PM of July 22,2025. Step-2: Click on the given Link received on e-mail or on your Mobile No. Step-3: Enter the Passco
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|11|eazypay icicibank.com- Mail sent Successfully to rollno@rgipt acin Step-7: Fee Receipt shall be generated along with Reference Id and at the bottom of the page you will get the option to Download/ Pri
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|12|(dva $ #fufT4H & 04l7 refqa 754 4ery #1 0G HreTt) Rajiv Gandhi Institute of Petroleum Technology (An Institution of National Importance established under an Act of Parliament) Jais, Amethi- 229304, UP
Notification for Fee Submission-All UG Students of B.Tech. & IDD Programme-2022-2023-2024 Batch.pdf|13|1. AII Deans 2 Assistant Deans (Academic ffairs) 3. AII Heads of Department 4 Conveners, DUGC 5_ Chairman of Council Wardens 6. Chairman of CCIS 7. Chairman Training & Placement Committee 8. Chairman 