rules_regulation_020517.pdf|0|RULES, REGULATIONS AND PROCEDURES RELATING TO THE UG & PG ACADEMIC PROGRAMMES AT “RAJIV GANDHI INSTITUTE OF PETORLEUM TECHNOLOGY” 1 Credit System 1.1 Introduction 1.2 Number of Credits in a Course 1.3
rules_regulation_020517.pdf|1|3.1 Pre-registration 3.2 Date and Venue of Registration 3.3 Clearance of Dues 3.4 Advice on Courses 3.5 Lower and Upper Limits for Credits Registered 3.6 Minimum Student Registration in a Course 3.7 L
rules_regulation_020517.pdf|2|Fees, Hostel Availability, etc. 4.9 Branch change option 1 5.0 Normal and Maximum Duration 6.0 Amendments 7.0 Acknowledgements The rules, regulations and procedures given in this document will be appl
rules_regulation_020517.pdf|3|laboratory contact hours in a week, plus the time expected to be spent by the student outside the formal contact hours in a week. Each course is coordinated by a faculty member, called the ‘Course Ins
rules_regulation_020517.pdf|4|‘Course Instructors’. A letter grade, with a specified number of grade points, is awarded in each course for which a student is registered. 1.2 Number of Credits in a Course For each course L-T-P-C ar
rules_regulation_020517.pdf|5|week as: AL = 3.0 x L + 1.0 x T + 1.5 x P Depending on the academic load of a course, its credits, C, are assigned as follows: Academic Load AL = 5-6 7-8 9-12 13-15 Credits C = 2 3 4 5 The majority of
rules_regulation_020517.pdf|6|generally be between 165 and 175. (ii) Minimum credits to be earned in different areas (Engineering, HSS, Sciences, others). Details of these will be given later, and will be important while giving op
rules_regulation_020517.pdf|7|1.5 Physical Education Requirement for UG: In the first two semesters, there will be one compulsory courses of Physical Education (one in each semester) carrying one credit each. Pass/Fail grade will 
rules_regulation_020517.pdf|8|only given a pass or a fail grade (P/F grade). He / She earn credits towards graduation for earning a P grade; however, the grade does not affect his/her Semester Performance Index (SPI) and Cumulativ
rules_regulation_020517.pdf|9|In case a student fails in a course under PCO option the ‘F’ grade will appear in his/her grade sheet and the course would not count towards credits nor will it affect his/her SPI. He/She might have t
rules_regulation_020517.pdf|10|2.1 Award of Grades The grade awarded to a student in a course, for which he/she is registered, will be based on his/her performance in final semester/term examination, two mid-semester exams, quizzes
rules_regulation_020517.pdf|11|weightages would be decided and announced by the course instructor in the beginning of the course, so that the students are aware of the evaluation mechanism to be followed in the course. The grades t
rules_regulation_020517.pdf|12|S -- Satisfactory (for thesis research) X -- Unsatisfactory (for thesis/project work) I -- Incomplete (grade to be assigned within the stipulated time) V -- Transfer of course credit from an approved 
rules_regulation_020517.pdf|13|good or very bad overall performance by the class as a whole. A student is required to repeat all the courses in which he/she obtains an F grade. No substitution is allowed. While repeating a course, 
rules_regulation_020517.pdf|14|maximum time allowed for completing the degree including any semester/ term drop is 6 years for B. Tech, and 3 years for MBA. However, a student must continue to satisfy the minimum requirements (see 
rules_regulation_020517.pdf|15|credits If a PG student gets SPI 5.0 or less anytime during his/her stay, he/she will be asked to leave the programme. If the CPI is below 6.5 for 2 consecutive semesters, he/she will be asked to leav
rules_regulation_020517.pdf|16|(Later sections inform about the possibility of dropping a course if one is not faring well or of dropping a semester if one is seriously ill. These provisions should be well understood and utilized i
rules_regulation_020517.pdf|17|Academic Coordinator, subject to having fulfilled attendance requirements. Student must complete the requirements within stipulated time to convert ‘I’ to a regular grade. ---- P/F Grade These grades 
rules_regulation_020517.pdf|18|maximum). ---- V Grade This grade is given when courses are satisfactorily completed at another institution (with which RGIPT has an MOU on this matter and the specific arrangement for each student ha
rules_regulation_020517.pdf|19|students before finalizing the grades. The answer sheets should be preserved by the teacher (or by the Academic Section, in case of external faculty or guest faculty) for at least six months after the
rules_regulation_020517.pdf|20|weights being the approved credits of the respective courses. Thus, if a student obtains a grade whose numerical equivalent is G in a course, with C credits, then the SPI of the i i student is given b
rules_regulation_020517.pdf|21|till the completion of the last semester. Whenever a student is permitted to repeat or substitute a course, only the new grade is used in the computation of CPI, even if it is lower than the earlier g
rules_regulation_020517.pdf|22|(b) Students with CPI 5.0 and 5.5 SPI < 8.0 , and no backlog; (c) Students with CPI 5.0 and SPI 5. 0 , with backlog; (d) Students with CPI 5.0 and SPI < 5.0, with or without backlog; (e) Students with
rules_regulation_020517.pdf|23|the student in some semester(s). The performance of students in category (a) is considered ‘exceptional’. A letter, of congratulations is issued by the Chairman AC to the student and a copy sent to pa
rules_regulation_020517.pdf|24|students for the purpose of continuation in the Institute or termination of the programme. Any such advice is given in writing, along with the conditions for continuation, if continuation is permitted
rules_regulation_020517.pdf|25|subsequent semester. However, reduced academic load also implies that such students will take longer time to complete the programme. 2.7 Declaration of Results After the end of each semester and befor
rules_regulation_020517.pdf|26|(original grade and the new grade after repetition/substitution) appear on the Grade Sheet. However, only the grade obtained on repetition/substitution of the course is considered for the calculation 
rules_regulation_020517.pdf|27|for an integrated Master’s degree after 10+2, four semesters for Master’s after his/her B. Tech degree, 6 terms for MBA, and 6 semesters after B. Tech degree and 4 semesters after M. Tech. Degree for 
rules_regulation_020517.pdf|28|Convocation. The degree is awarded only after the BOG accords its approval. 2.8.2 Withdrawal of the Degree In extremely exceptional cases, when a gross violation of the graduation requirements is dete
rules_regulation_020517.pdf|29|degree students. The following guidelines and procedures are used for this purpose: Eligibility: The student who has scored grade ‘B-’ or better in the first attempt in all the courses taken thus far,
rules_regulation_020517.pdf|30|10 run in that semester in the chosen Institution. After finalizing the Institution and the courses intended to be taken there during a semester, a request should be made to the Dean Academic, in the 
rules_regulation_020517.pdf|31|Against each course for which a waiver is granted, a “V” appears on the Grade Sheet. All such courses carry zero weightage for SPI/CPI calculations, but, otherwise, count towards the academic load req
rules_regulation_020517.pdf|32|Financial Aspects: Any student, availing of this facility, has to bear all the expenses incurred. Further, he/she shall continue to pay the tuition fees to RGIPT for the period he/she is away to the o
rules_regulation_020517.pdf|33|campus,  Show good neighborly behavior to fellow students,  Be logical and lucid in expressing your own opinions,  Show due respect to the opinion of others even if it differs from your own opinion
rules_regulation_020517.pdf|34| Do not disturb other fellow students while they are studying,  Do not exhibit noisy and unseemly behavior, 11  Do not indulge in ragging in any form, whatsoever,  Do not indulge in any activity w
rules_regulation_020517.pdf|35|The Chief Warden has the authority to reprimand, impose fine or take any other suitable measure against a resident who violates either the CCS or rules and regulations pertaining to the Halls of Resid
rules_regulation_020517.pdf|36|is a sample of the kinds of punishments:  Reprimanding a student,  Putting the student on Disciplinary Probation,  Imposing a fine (monetary or otherwise) on the student,  Debarring the student fr
rules_regulation_020517.pdf|37|the student has successfully completed all the stipulated graduation requirements,  Terminating the academic programme of the student on disciplinary grounds. Any action that amounts to terminating t
rules_regulation_020517.pdf|38|as per a specified schedule, given before the end of the previous semester. All students are required to complete the pre-registration formalities in consultation with their Faculty Advisers/ Academic
rules_regulation_020517.pdf|39|for courses is done in the beginning of each semester. The date, time and venue of registration are announced in advance. Since registration is a very important procedural part of the credit system, i
rules_regulation_020517.pdf|40|before he/she can be registered for courses. In subsequent semesters, the student should obtain two “No Dues Certificate”, before he/she can be registered for the courses of a semester, one from the “
rules_regulation_020517.pdf|41|Institute dues will include the current semester's tuition fees, other dues as well as the previous semester's arrears, if any. The drafts should be drawn in the name of Rajiv Gandhi Institute of Petr
rules_regulation_020517.pdf|42|A U.G. student should register for a minimum of 16 credits in a semester, if he/she has at least that many credits to be completed for the degree he/she is in. No U.G. student should register for more
rules_regulation_020517.pdf|43|or unable to send an authorized representative with medical certificate, he/she may apply to the Academic Coordinator for late registration. The Academic Coordinator will consider and may approve late
rules_regulation_020517.pdf|44|This extra fee will not be waived, whatever be the reason for the late registration. Late registration would end three days after the start of the semester. 3.8(A) Addition, Deletion of Courses: A stu
rules_regulation_020517.pdf|45|student should discuss this with the course instructor/counselor. He / She should apply on the prescribed form within the time as prescribed above. A withdrawal grade (W) will be awarded in such cases
rules_regulation_020517.pdf|46|listing the reason should be given to the instructor beforehand or apply for leave in the prescribed form available at academic office. In case of an emergency, the student may send a message to the i
rules_regulation_020517.pdf|47|other unforeseen circumstances, a possible relaxation to the above rule may be considered with prior approval from the Chairman, Senate. Punctuality is highly appreciated and latecomers will not be gi
rules_regulation_020517.pdf|48|participation in such events. 4.3 Semester Withdrawal In case, the valid period of absence (on medical grounds) is more than 02 weeks during the semester, the student may apply for withdrawal from the
rules_regulation_020517.pdf|49|two weeks, should approach the Instructor or the Course Coordinator for make-up test or assignment immediately on returning to the class. A medical certificate from the Institute approved Medical Offi
rules_regulation_020517.pdf|50|In case of absence on medical ground or other extraordinary reasons during the Major Test period (typically the final or end- semester exam), an application for ‘I’ grade may be made by the student on
rules_regulation_020517.pdf|51|end-semester exams. If a student is ill while he/she is out of station, the student has to submit a medical certificate from an appropriate doctor/hospital. The conduct of makeup exam will be decided 
rules_regulation_020517.pdf|52|examination is accepted, this would be informed to the course instructor. In such a case, the instructor will conduct a makeup examination on the date announced by the Academic Coordinator. The instru
rules_regulation_020517.pdf|53|The candidate will have to register for the semester and spend one additional semester at the institute. The degree will be awarded at the end of 9th Semester. 4.9 Branch Change Option 16 The students
rules_regulation_020517.pdf|54|maximum is 6 years. For M. Tech. / MBA: The normal duration for the completion of the requirements is 2 years, and the maximum is 3 years. For Ph. D: The normal duration for the completion of the requ
rules_regulation_020517.pdf|55|The maximum duration will not be increased. However, a student must continue to satisfy the minimum SPI/ CPI requirements stated earlier all through else his/her programme may be terminated any time. 
rules_regulation_020517.pdf|56|the PhD programme after M. Tech, and after 4 years for those who enter the PhD programme after B. Tech. For PhD students, an exception of one semester may be made in case unforeseen difficulties were 
rules_regulation_020517.pdf|57|programme the concerned student may be granted a special leave maximum up to a year. But such special cases need careful examination by the institute doctor/panel of doctors/doctors from institute rec
rules_regulation_020517.pdf|58|examination by the institute doctor/panel of doctors. If the concerned student is found medically fit to join the programme he/she may be allowed to register at the beginning of the term for which lea
rules_regulation_020517.pdf|59|dress code will be considered as a gross violation of discipline and may attract severe penalties. EXAMINATION RULES A student who violate any of the Examination Regulations will be liable to discipli
rules_regulation_020517.pdf|60|mobile phones, programmable calculators, electronic gadgets, any material notes pertaining to the examination etc. 18  Do not bring any unauthorized material (e.g. written notes, notes in dictionarie
rules_regulation_020517.pdf|61|the examination.  Listen carefully to instructions. Students are required to comply with the instructions of invigilators at all times. For example, if you are asked to sit in a designated place then
rules_regulation_020517.pdf|62| You are NOT allowed to leave the examination hall during the last 10 minutes of the examination and during the collection of the answer scripts. All students must remain seated throughout this perio
rules_regulation_020517.pdf|63|the examination. If you are present for the examination and do not submit your answer script, you will be deemed to have sat for a failed the examination concerned. Any unauthorized removal of answer 
rules_regulation_020517.pdf|64|may be eligible for make-up examination. Application must be received by student no later than 03 working days after your exam in the relevant examination period. Applications received after this dead
rules_regulation_020517.pdf|65|examination to be approved. 19  All students are expected to behave responsibly and honestly with the invigilators or staff. In case any objectionable behavior of any student reported by the invigila
rules_regulation_020517.pdf|66|Technology Kanpur, the Indian Institute of Information Technology Hyderabad and the L. N. Mittal Institute of Information Technology Jaipur, in the preparation of this document. Discussions with sever