Safety_regulations.pdf|0|Rajiv Gandhi Institute of Petroleum Technology, Jais, Amethi Laboratory Safety Rules and Regulations GENERAL RULES 1. Working alone in the laboratory is strictly not allowed. Do work in the laboratory
Safety_regulations.pdf|1|latches, computer keyboards, even your own laptop and bags. Gloves may contaminate common / public items. 5. Face shield must be worn, if needed. Use mask as per the instruction, when working with tox
Safety_regulations.pdf|2|by (cotton) clothing and leather shoes offers the best protection against chemical spills and fire. 7. Everyone should know the location and operation of the laboratory safety equipment. This includes
Safety_regulations.pdf|3|11. When lab work is completed, all materials must be returned to their proper places and the working benches, instruments and glassware must be cleaned up. 12. Many chemicals are toxic and/or corrosi
Safety_regulations.pdf|4| TERATOGENIC : They cause defects in the unborn fetus.  MUTAGENIC : They cause genetic mutations.  EXPLOSIVE : They explode, usually on being mixed with air.  CORROSIVE : They burn the eyes, lungs
Safety_regulations.pdf|5|your laboratory working bench. It may be contaminate with chemicals and be unsafe. For the same reason, you should not bring food or drink items into the laboratory (except in seating room). Laborator
Safety_regulations.pdf|6|refluxing or distillation, never place solvents in an open beaker. Pouring solvents in the vicinity of a flame is extremely hazardous. Use an oil bath, steam bath, water bath, heating mantle, or hot p
Safety_regulations.pdf|7|24. Benzene and chlorinated solvents are toxic. In some cases, the toxic effect is cumulative. Avoid contact with the skin and inhalation of solvent vapors. 25. Corrosive substances, which give off no
Safety_regulations.pdf|8|waste cans / trash-boxes. 26. Over the last several years, a number of organic compounds have been confirmed as carcinogens and the list is steadily growing. It is best to assume that all chemicals ar
Safety_regulations.pdf|9|28. Never pipette by mouth. Drawing up a liquid should be done only with a rubber bulb or micropipette. 29. Make sure to be in a safe position/place before helping others. 30. In case if a person’s cl
Safety_regulations.pdf|10|place the chemical and equipment safely to the nearest possible table/bench, exit the building calmly. 32. There are carbon dioxide extinguishers in and around the laboratory and the positions and ope
Safety_regulations.pdf|11|Telephone : 4751 Mobile : 7800617941  Health Centre (RGIPT) Telephone : 4613  Ambulance Service (RGIPT). Mobile: 7081482420 / 9919281154