Students Misconduct and Disciplinary Policy.pdf|0|RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY (RGIPT) Students Misconduct and Disciplinary Policy 1. Purpose and Scope This policy outlines the standards of student conduct at RGIPT and details the p
Students Misconduct and Disciplinary Policy.pdf|1|• Acts of assault, bullying, coercion, or making malicious allegations. • Possession or use of weapons or hazardous substances. • Participation in strikes, agitations, or processions disrupting Instit
Students Misconduct and Disciplinary Policy.pdf|2|• Publishing or sharing defamatory, misleading, or obscene content online targeting RGIPT stakeholders. • Unauthorized disclosure of confidential Institute information on public platforms. • Unauthori
Students Misconduct and Disciplinary Policy.pdf|3|• Any act deemed as misconduct by the Director. Note: Ragging in any form is a criminal offense and strictly prohibited, as per the directives of the Hon’ble Supreme Court of India. B. Composition of 
Students Misconduct and Disciplinary Policy.pdf|4|definitions under Indian law shall apply. 3. Disciplinary Actions Disciplinary measures shall vary based on the severity of the misconduct: A. Minor Misconduct • Oral Reprimand – Verbal warning. • Wri
Students Misconduct and Disciplinary Policy.pdf|5|o Withdrawal of scholarships/fellowships. • Major Fine: ₹5,000 to ₹25,000 (may increase with repeated violations). • Debarment: Temporary exclusion from exams. • Suspension: Temporary removal from aca
Students Misconduct and Disciplinary Policy.pdf|6|4. Authorities Empowered to Impose Disciplinary Actions Type of Appellate Sanctioning Authority Approving Authority Misconduct Authority Standing Disciplinary Minor Dean, Student Affairs Director Comm
Students Misconduct and Disciplinary Policy.pdf|7|Committee may proceed ex-parte after recording reasons. 4. Timeline: Inquiry should conclude within 15 days; maximum 30 days. In exceptional cases, a 30-day extension may be granted by the Director. I
Students Misconduct and Disciplinary Policy.pdf|8|7. Notification: The Registrar shall notify the final order to both parties. 6. Appeals and Redressal Mechanism • Both the student and the complainant are entitled to one appeal to the Director, whose
Students Misconduct and Disciplinary Policy.pdf|9|6. The final decision will be notified by the Registrar. 7. Interpretation a. Any dispute regarding the interpretation of this policy shall be referred to the Director, whose decision shall be final a