UG Admission Brochure.pdf|0|I B nformatIon rochure B. Tech Admission 2022-23 RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY (An Institution of National Importance established by the Government of India) Jais, Amethi, Uttar Prade
UG Admission Brochure.pdf|1|5. Internal Quality Assurance Cell 10 6. Training & Placement 10-11 7. Co-Curricular Activities 11 7.1. Design and Innovation Centre 11 7.2. Incubation Centre (IC) 11 7.3. Science and Technology Counc
UG Admission Brochure.pdf|2|1.7 Fees Details 18-19 1.7.1 Refund Policy 19 1.8 Application Process 19-22 2. Admission Office 22 3. How to reach 23 1 | P a g e PART A: General Information 1. About RGIPT Rajiv Gandhi Institute of P
UG Admission Brochure.pdf|3|GAIL, BPCL and HPCL) in association with the Oil Industry Development Board (OIDB). The Institute is associated with leading international universities and institutions specializing in the domain of P
UG Admission Brochure.pdf|4|offered by the Institute. These programs seek to develop human resource of the highest caliber to cater to the needs of industries, R & D organizations, and academic institutions. The vision of the in
UG Admission Brochure.pdf|5|engineering, whereas Technology education requires broad based fundamental knowledge of both science and engineering with analytical and innovative skills. Quality Engineering education should inculca
UG Admission Brochure.pdf|6|and (iii) builds character. The educational pedagogy and curriculum of RGIPT is diverse. Thus, for catering to students with different capabilities (mental, emotional and physical), the educational pr
UG Admission Brochure.pdf|7|industrial need and inputs. 3 | P a g e 3. Programmes Offered Engineering education requires expert knowledge and skills in respective branches of engineering, whereas Technology education requires br
UG Admission Brochure.pdf|8| B. Tech. in Chemical Engineering  B. Tech. in Computer Science & Engineering  B. Tech. in Electronics Engineering  B. Tech. in Electrical Engineering, Major: E Vehicle  B. Tech. in Information T
UG Admission Brochure.pdf|9|registered in various B. Tech. and IDD programmes are as follows: B. Tech./IDD Programme Minor B. Tech. in Chemical Engineering  Computer Science & Engineering  Information Technology  Electronics 
UG Admission Brochure.pdf|10|Vehicle  Information Technology  Chemical Engineering  Petroleum Engineering  Mathematics & Computing  Energy Management  Business Consulting B. Tech. in Information Technology  Petroleum Engin
UG Admission Brochure.pdf|11| Information Technology  Electronics Engineering  Mathematics & Computing  Energy Management  Business Consulting B. Tech. in Computer Science & Design Engg  Petroleum Engineering  Chemical Eng
UG Admission Brochure.pdf|12| Electronics Engineering  Energy Management  Business Consulting 5 | P a g e 4. Campus Life at RGIPT RGIPT Jais Centre is located at Jais, Amethi, Uttar Pradesh and the campus is spread over 47 acr
UG Admission Brochure.pdf|13|The campus is 24 hours Wi-fi/LAN enabled. 4.1 Centre for Computing and Information Services Centre for Computing and Information Services (CCIS) caters to the Computational and Information Technology 
UG Admission Brochure.pdf|14|6 | P a g e 4.2 Library The RGIPT central library is fully computerized with a large and ever-growing collection of books. Currently, more than 8000 books covering engineering, science, humanities, an
UG Admission Brochure.pdf|15|4.3.1 UG LABORATORIES: As laboratories are considered as an integral part of UG program, the students need to perform 10-12 laboratory courses in each program. Each of these UG laboratories are well-e
UG Admission Brochure.pdf|16|NMR, XPS, XRF, FESEM, HRTEM, XRD, SAXS, AFM, etc. are installed to characterize the samples of in-house researchers as well as received from outside. These facilities are maintained and operated by qu
UG Admission Brochure.pdf|17|4.4 Linkage with Industry Students of RGIPT are encouraged to pursue their internship and research activities under the joint mentorship of faculty members of the Institute and industrial experts. The
UG Admission Brochure.pdf|18|bringing in a number of renowned industries into the ambit by signing of MoUs, so as to provide a large pool of students this opportunity of the joint industrial mentorship. The linkage helps in train
UG Admission Brochure.pdf|19|is offered to a selective number of non-SC/ST students. 4.7 Earn while Learn The institute provides opportunities for students to assist in various academic activities and earn while doing so. 4.8 Stu
UG Admission Brochure.pdf|20|various training programs, workshops for the exposure of students into the industry. 5. Internal Quality Assurance Cell IQAC is established at the institute to develop a system for conscious, consiste
UG Admission Brochure.pdf|21|devices and support service systems. The Institution has a dedicated Training & Placement cell headed by a Professor In-charge to look after the placement activities. In an attempt to give world class
UG Admission Brochure.pdf|22|companies (Torrent Gas, Wipro Ltd, Shell, Infosys. The graduates of RGIPT are preferred for placement in the Oil and Energy sector industries. Like the previous years, most of the leading companies an
UG Admission Brochure.pdf|23|Yahoo, Microsoft, Intel, Qualcomm, Apple, Sony, Oracle, Amazon, Cisco Systems (India) Pvt Ltd, J.P. Morgan Chase, Samsung India Electronics Pvt Ltd, Taiwan Semiconductor Manufacturing Company (TSMC), 
UG Admission Brochure.pdf|24|A successful education is the one that infuses creativity. At RGIPT, the teachers strive to awaken joy of creativity and learning among the students. In order elevate to a level of a world class techn
UG Admission Brochure.pdf|25|The Design Innovation Center (DIC) is constituted to sponsor and monitor the following kinds of technical projects:  Short Term/Summer Projects (with duration around less than three months)  Extende
UG Admission Brochure.pdf|26|innovative ideas of its incubatees in the field of science, technology and management. Also, the products and services of the RGIPT IC’s incubatees would primarily focus on the improving living standa
UG Admission Brochure.pdf|27|The Science and Technology Council of RGIPT is one of the most active and versatile faculty- guided and student-led initiative of the Institute. The prime focus of the council is to inculcate in the s
UG Admission Brochure.pdf|28|Entrepreneurship Cell, S&T Council organized a special event "Unicus" which provided the students with a chance to channel their inner entrepreneurial spirit and propose innovative solutions for niche
UG Admission Brochure.pdf|29|and enhancing their potential. Student Chapter organizes seminars, guest lectures, analytical quizzes, placement talks, and intern talks among many other events enabling the attendees to have an overa
UG Admission Brochure.pdf|30|outdoor and indoor gaming facilities like badminton, basketball, volleyball, tennis, football, kho- kho, cricket, chess, table tennis, snooker, and carrom. The annual event of the Institute, Energia, 
UG Admission Brochure.pdf|31|8.2 Social Council The greatest barrier to development is illiteracy. Hence, ARPAN, the social club of our Institute, has initiated the Gyan Arpan Teaching Centre to teach the school children of the n
UG Admission Brochure.pdf|32|villagers is done by means of nukkad natak, charts, models, pamphlets and banners. 8.3 Cultural Council The Cultural Council at RGIPT was established for the students to explore their unique talents a
UG Admission Brochure.pdf|33|Fine Arts Club. 14 | P a ge 8.4 Alumni Association Alumni Association by the name of “Rajiv Gandhi Institute of Petroleum Technology Alumni Association” has been formed at the institute with the purpo
UG Admission Brochure.pdf|34|9. Hostel Being a residential Institution, it is compulsory for all students to reside in the campus during their programs. RGIPT provides separate hostel facilities for boys and girls. There are 542 
UG Admission Brochure.pdf|35| Furnished rooms with bed, study table, chair, partitioned almirah, fan, fluorescent tubes.  RO water purifier and geyser facilities.  Round the clock power back up facility.  Round the clock Wi-F
UG Admission Brochure.pdf|36|cafeteria which remains open round the clock. The student participation in hostel affairs is an essential component of the general administration and decision making. 10. Health facilities The Health 
UG Admission Brochure.pdf|37|service is available for catering to the critical cases. In case of serious medical emergencies patients are shifted to repute nearby hospitals like Sanjay Gandhi Hospital, Amethi, AIIMS, Raebareli, e
UG Admission Brochure.pdf|38|either as Engineers/Managers or are pursuing higher studies in renowned educational institutes in India and abroad. The female students are provided with dedicated hostel facilities and a safe & secur
UG Admission Brochure.pdf|39|Science & Engineering B. Tech. in Electronics 50 20 5 13 8 4 9 Engineering B. Tech. in Electrical 30 12 3 8 5 2 6 Engineering Major: E Vehicle B. Tech. in Information 50 20 5 13 8 4 9 Technology B. Te
UG Admission Brochure.pdf|40|will receive both B. Tech. and M. Tech. Degrees. 17 | P a ge 1.2. Application Fee The application fee is non-refundable Rs. 600/- + Rs. 108/- (Taxes) for SC/ST/PwD and female Candidates Rs. 1200/- + R
UG Admission Brochure.pdf|41|Foreign students are also eligible to apply for admission. 10% supernumerary seats of the total sanctioned strength are allotted for foreign students. He/She must be within the top 20% of the successf
UG Admission Brochure.pdf|42|https://www.studyinindia.gov.in/Explore/ViewDetails?instituteid=SII-I-0253&For=Courses Admission for his category are offered under the Cultural Exchange Fellowship Programme of the Government of Indi
UG Admission Brochure.pdf|43|seats will be reserved for female candidates on supernumerary basis over the current strength. The Certificate for SC/ST/OBC (NCL)/PwD/EWS must be submitted in the specified format during time of admi
UG Admission Brochure.pdf|44|as per Table 3 2nd Round of Admission Last date of receiving applications for 2nd Round 09th October 2022, Sunday Declaration of list of selected candidates for 2nd Round** 12th October 2022, Wednesda
UG Admission Brochure.pdf|45|* Admission portal will remain open for subsequent round of admission. If seats remain vacant after 2nd round, then further rounds of admission will be conducted. **The entire admission process is onl
UG Admission Brochure.pdf|46|Amenities, Hostel Establishment, Hostel Seat Rent, Medical Fee, Alumni Membership Fee, Student’s Welfare Fund, Caution Money and Institute Development Fund. Table 3: Admission Fee Details Seat blockin
UG Admission Brochure.pdf|47|semester* Fees for Minor Rs. 10,000/- per semester Program (optional) commencing from 3rd semester *For first semester, this amount will be deposited on arrival at the campus Fees for Foreign Students
UG Admission Brochure.pdf|48|included in the loan. 1.7.1 Refund Policy Table 4: Amount to be Refunded Withdrawal before GEN/OBC/EWS SC/ST/PwD the last date of B. Tech: Rs. 28500/- * B. Tech: Rs. 28500/-* particular round IDD: Rs.
UG Admission Brochure.pdf|49|Refund process will take 3-4 weeks after the commencement of the classes. 20 | P a ge 1.8 Application Process Interested candidates should submit their application online before the stipulated deadli
UG Admission Brochure.pdf|50|given below to complete the application procedure. Step-1 Procedure for Registration as a New Student 1. Choose B Tech Program and click [Proceed for Registration]. 2. Now you are in Registration page
UG Admission Brochure.pdf|51|number and email ID. Step-2 Procedure to Login 1. Enter your login credentials received through SMS and/or Email to login into the Online Admission Application System 2. After Login you will be redire
UG Admission Brochure.pdf|52|Card/Credit Card/Net Banking/UPI. The stipulated application fee to be paid is given in the Clause 6.7 for reference. 3. Select your Payment Mode and click on Proceed to Pay Online button. 4. You will
UG Admission Brochure.pdf|53|3. Fill your details like Father’s Name, Mother’s Name, Caste Certificate Number, Nationality etc. 4. After filling all the details correctly click on Save & Continue button. 5. You will receive a Pop
UG Admission Brochure.pdf|54|else fill the details of Permanent Address. 4. After filling all the details correctly click on Save & Continue button. 5. You will receive a Pop-Up Message of successful submission of Address & Conta
UG Admission Brochure.pdf|55|4. You will receive a Pop-Up Message of successful submission of details. Click on OK button to proceed further. Step-7 Procedure to Fill JEE (Advanced)/JEE (Mains) Details 1. After successful submiss
UG Admission Brochure.pdf|56|Bank Details Page. 2. Fill your details like Name of Account Holder,Name of Bank,Account Number, IFSC Code,PAN. 3. After filling all the details correctly click on Save & Continue button. 4. You will 
UG Admission Brochure.pdf|57|1. After successfully uploading the documents applicant will be redirected to Review Application Page. 2. In case you wish to make any change in the form you can click on Edit button of that particula
UG Admission Brochure.pdf|58|on Download Receipt button which will appear after final submission of application. Note: No changes will be allowed after submission of form; hence applicants are advised to make required changes, if
UG Admission Brochure.pdf|59|Table 2. The candidates should be aware of the timeline and must adhere to the same. 2. Admission Office 3rd Floor, Administrative Block Rajiv Gandhi Institute of Petroleum Technology Bahadurpur, Jais
UG Admission Brochure.pdf|60|From Jais Railway Station to RGIPT (Click Here) List of Trains passing Via Jais (Click Here) Important links: About RGIPT: https://www.rgipt.ac.in/en/article/home About Director: https://www.rgipt.ac.
UG Admission Brochure.pdf|61|► About Academics [Link] Rajiv Gandhi Institute of Petroleum Technology (RGIPT) ► About Placement [Link] Bahadurpur, Jais, Amethi - 229304, Uttar Pradesh ► About Research Activities [Link] Phone: 0535