UG Ordinance manual RGIPT-Final.pdf|0|ORDINANCES GOVERNING UNDERGRADUATE PROGRAMMES (UG MANUAL) Passed in the Senate Meeting held on Friday, September 13th, 2019 RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY, JAIS Amethi- 229304 Page | 1
UG Ordinance manual RGIPT-Final.pdf|1|5.2 Registration of a Deficient Student 11 5.3 Late Registration 11 5.4 Adding and Dropping of Courses 11 5.5 Academic Load 12 5.6 Summer Term Registration 12 5.7 Cancellation of Registration 12 6. TE
UG Ordinance manual RGIPT-Final.pdf|2|10. DEGREES 20 10.1 Award of Degree 20 10.2 Withdrawal of Degree 20 11. SCHLORSHIPS, PRIZES AND MEDALS 20 11.1 Scholarships 21 11.2 Prizes and Medals 21 12. CONDUCT AND DISCIPLINE 21 12.1 Code of Cond
UG Ordinance manual RGIPT-Final.pdf|3|Ministry of Petroleum and Natural Gas, Government of India. The Institute is accorded the status of “Institute of National Importance” along the lines of the Indian Institutes of Technology (IIT) unde
UG Ordinance manual RGIPT-Final.pdf|4|and PG programmes unique is the active participation of the leading Oil Companies in the academic activities. RGIPT is co-promoted as an energy domain specific institute by six leading Oil Public Sect
UG Ordinance manual RGIPT-Final.pdf|5|including Chemistry, Physics and Mathematical science and various social sciences areas including English, Sociology etc. The institute has a Department of Management Studies consisting of faculty mem
UG Ordinance manual RGIPT-Final.pdf|6|materials, devices and support service systems. These are made available by manufacturing and service industries. UG degree holders in engineering and technology are directly employed by these Industr
UG Ordinance manual RGIPT-Final.pdf|7|analytical and managerial etc.), humanism, social responsibility and business aptitude in students. The goal of undergraduate engineering and technology education is that the student; (i) learn the co
UG Ordinance manual RGIPT-Final.pdf|8|Page | 4 attempt can be made by redefining the undergraduate programmes in terms of its academic units “course” and session unit “semester”. Course is unique in terms of its specific subject referred 
UG Ordinance manual RGIPT-Final.pdf|9|categorize the levels of learning a suitable grading system is adopted. Grading is a process that identifies learning in a course. It guides and motivates students towards learning and determines the 
UG Ordinance manual RGIPT-Final.pdf|10|Pass Grade. The courses are linked together so as to they form a unified body or structure of the programme. Implementation of educational programme depends on the structure and organization of semest
UG Ordinance manual RGIPT-Final.pdf|11|people pursuing a programme become professionals. 1. INTRODUCTION Institutes of higher learning can set their objectives by adopting this simple philosophy in such a way that it can satisfy the needs 
UG Ordinance manual RGIPT-Final.pdf|12|2. To create infrastructure, for development of knowledge base, innovation and creativity of highest quality amongst students and faculty of the Institute. 3. To create an ethical and healthy interact
UG Ordinance manual RGIPT-Final.pdf|13|finding their ways in academics. In library and web based learning, self-study, seminars, projects, practical training are important components. These are successful, only when smaller groups of stude
UG Ordinance manual RGIPT-Final.pdf|14|examinations and grading system, with rigidness of a part (course) and flexibility of choice of different parts (course). In curricula flexibility of choice needs some elaboration: Horizons of science
UG Ordinance manual RGIPT-Final.pdf|15|disciplines. An Institute can serve the objective of various classes of students in a better way when some flexibility of choice of subjects is also available across these boundaries. This manual sets
UG Ordinance manual RGIPT-Final.pdf|16| The Dean (Academic Affairs) Convener  All the Conveners of Department Undergraduate Committee (DUGC) Members  Assistant Registrar Member  Two UG Student Representatives Members The Senate Undergr
UG Ordinance manual RGIPT-Final.pdf|17| conduct of examinations, Page | 6  evaluation of academic performance, and  such other related matters as may be referred to it by the Senate. Functions of the SUGC consist primarily of general po
UG Ordinance manual RGIPT-Final.pdf|18|Departmental Under-Graduate Committees (DUGCs). The Chairman Senate appoints the Chairpersons of both CCC and APEC. These Chairpersons, in consultation with the SUGC Chairperson, form their respective
UG Ordinance manual RGIPT-Final.pdf|19|The Department Under-Graduate Committee (DUGC) consists of a Convener (nominated by the Head of the Department in consultation with the faculty of the Department), the Head of the Department, a minimu
UG Ordinance manual RGIPT-Final.pdf|20|programmes and makes recommendations to the SUGC in all academic matters. 1.3 Office of Dean (Academic Affairs) The office of the Dean (Academic Affairs), called the Academic Section, is responsible f
UG Ordinance manual RGIPT-Final.pdf|21|communication between the students, instructors, departments/ interdisciplinary programmes and SUGC. The under-graduate (UG) office of the Academic Section assists the SUGC and its subcommittees in th
UG Ordinance manual RGIPT-Final.pdf|22|year and ends in the middle of July in the subsequent year. It is divided into three parts roughly as follows: Page | 7 Semester Odd From the last week of July or first week of August to the last week
UG Ordinance manual RGIPT-Final.pdf|23|working weeks, including the seven days taken up for one Mid Term and one end-term examinations. 2.1 Academic Calendar The dates of all important events, such as orientation, registration, late regist
UG Ordinance manual RGIPT-Final.pdf|24|a year in July through Joint Entrance Examination (JEE) conducted on an All India level by IITs. The procedures and requirements for admission to these programmes are specified in the JEE Information 
UG Ordinance manual RGIPT-Final.pdf|25|i) Reservation of seats for various categories shall be as prescribed by the Board of Governors. The admission process for the reserved seats is as stated below: ii) SC and ST Candidates – Reserved se
UG Ordinance manual RGIPT-Final.pdf|26|the IIT in which they are admitted. iii)Other Backward Classes (OBC) Candidates (Not belonging to creamy layer) Reserved seats are filled on the basis of JEE qualifying norms specified for them. Page 
UG Ordinance manual RGIPT-Final.pdf|27|vi) Girl Candidates: The supernumerary reserved seats for girls (14% of the total seats) are to be filled as per the norms of MHRD. 3.2 Change of Programme - The students shall normally pursue the res
UG Ordinance manual RGIPT-Final.pdf|28|Institute of Petroleum Technology (RGIPT). She/he is also a non-degree student as the Institute does not give its degree to such students. The non-degree student may carry out research, take courses f
UG Ordinance manual RGIPT-Final.pdf|29|application through DUGC and SUGC to the Dean (Academic Affairs). The applications will be finally approved by the Chairman, Senate. A non-degree student may be admitted for a maximum period of one ye
UG Ordinance manual RGIPT-Final.pdf|30|their mark sheets, provisional certificates, etc. of the qualifying examination and other documents by the last date specified for the purpose in the Academic Calendar. If any student fails to submit 
UG Ordinance manual RGIPT-Final.pdf|31|a) be eligible, b) go through the laid-down admission procedure, and c) pays the prescribed fees. All admissions to the undergraduate programmes should be formally approved by the SUGC. Page | 9 4. CU
UG Ordinance manual RGIPT-Final.pdf|32|irrespective of his/her chosen branch of specialization. It consists of a package of prescribed compulsory and elective courses in Basic Sciences, Basic Engineering, Engineering Science, Computing, En
UG Ordinance manual RGIPT-Final.pdf|33|student must ensure that he/she has completed the pre-requisites, if any, for each course to be registered. The sole responsibility for registration rests with the student concerned. 5.1 Registration 
UG Ordinance manual RGIPT-Final.pdf|34|students on registration for courses of the departmental requirements. The registration procedure involves: a) filling of the registration form, mentioning the courses to be credited in the semester b
UG Ordinance manual RGIPT-Final.pdf|35|programme. Further, backlog courses must be arranged as far as possible in the sequence of their accumulation. A deficient student due to academic performance may be advised not to register for the pr
UG Ordinance manual RGIPT-Final.pdf|36|Page | 10 extraordinary circumstances, if a student is unable to register on the specified registration date for any compelling reason like illness, internship etc., he/she may be permitted for late r
UG Ordinance manual RGIPT-Final.pdf|37|permitted beyond the specified late registration date. However, if a student seeks prior permission to register late on valid grounds, Dean (Academic Affairs) may allow and exempt him/her from payment
UG Ordinance manual RGIPT-Final.pdf|38|certificate and other medical records) but within two weeks of the date of late registration to Dean (Academic Affairs) through the respective HOD/DUGC convener. Dean (Academic Affairs) may recommend 
UG Ordinance manual RGIPT-Final.pdf|39|DUGC and submit the form to the Office of Dean (Academic Affairs) for approval. A student may be permitted to withdraw course(s) till four weeks after the commencement of semester with the following c
UG Ordinance manual RGIPT-Final.pdf|40|for that course for any other reason. 5.5 Academic Load A student will normally register for around 50-60 credits in a semester as per the respective programme. Each course carries a weightage in term
UG Ordinance manual RGIPT-Final.pdf|41|8.5. Further, a student can register for an overload of 5-10 research units from the 3rd semester onwards after approval of research convener (supervisor) and DUGC. An overload of one course from III 
UG Ordinance manual RGIPT-Final.pdf|42|requirement of the deficient students. Students register for these courses at the beginning of the Summer Term on the recommendation of the APEC and/or DUGC and approval of Dean (Academic Affairs). Th
UG Ordinance manual RGIPT-Final.pdf|43|cancellation of the registration of a student from all the courses in that semester. 6. TEACHING AND EVALUATION 6.1 Teaching a) Medium - The medium of instruction is ENGLISH. However, teaching of cour
UG Ordinance manual RGIPT-Final.pdf|44|c) List of Courses - The list of courses to be offered by a Department is finalized before the beginning of the semester/ summer term by the concerned DUGC, taking into consideration all the requireme
UG Ordinance manual RGIPT-Final.pdf|45|office within the prescribed time limit. e) Teaching Assignments - The course convener, teachers, tutors and TAs for all the courses offered by a department/school during the semester/summer term are 
UG Ordinance manual RGIPT-Final.pdf|46|course will not be entered in his/her Grade Report. 6.2 Attendance Attendance of students in lectures, tutorials, practical and project work is important for learning process. Participation of student
UG Ordinance manual RGIPT-Final.pdf|47|attendance is allowed for minor illness and urgencies, for which no application will be required to be submitted. Further, relaxation of seven days in form of Permitted Leave of Absence (PLA) will be 
UG Ordinance manual RGIPT-Final.pdf|48|Any illness of duration less than 2 weeks shall not be considered for the above mentioned relaxation. The course convener will calculate the attendance %age on the basis of the actual number of classe
UG Ordinance manual RGIPT-Final.pdf|49|and CPI of the candidate. The student is responsible to keep a record of his/her attendance in each course. However, the course convener may inform the student, if the attendance of any student falls 
UG Ordinance manual RGIPT-Final.pdf|50|course through tutorials, practicals, home assignments, term papers, field work, seminars, quizzes, Periodical Tests, Mid Term Examination, the End-Semester Examination, as applicable. 6.3.2 The distr
UG Ordinance manual RGIPT-Final.pdf|51|(c) Laboratory Courses: (i) Sessional work, quizzes and regularity 50 (ii) Practical examination 50 Total 100 Page | 13 6.3.3 For each type of project a Project Coordination Committee (PCC) shall be c
UG Ordinance manual RGIPT-Final.pdf|52|The list of projects will be communicated to students and a tentative assignment of projects will be completed by the committee before the end of the previous semester. In assigning projects interest 
UG Ordinance manual RGIPT-Final.pdf|53|Supervisor) be assigned to a student. One of the supervisors may be from other departments/ schools. The final assignment of projects and supervisor(s) be completed by the Department by the First Week
UG Ordinance manual RGIPT-Final.pdf|54|The Evaluation Panel once formed will do monitoring and evaluation of projects for the whole duration of projects based on the synopses and work plan. The projects shall be evaluated twice in a semest
UG Ordinance manual RGIPT-Final.pdf|55|6.3.4 The Summer Training shall normally be evaluated through the quality of work carried out, the report submission and seminar presentation(s). 6.3.5 Coordination Committee: (a) For each course of a
UG Ordinance manual RGIPT-Final.pdf|56|have at least two members. If only one teacher is involved in teaching, the DUGC will include one additional faculty of the area related to the course as member in the committee. In no case a tutor or
UG Ordinance manual RGIPT-Final.pdf|57|following should be observed by the Coordination Committee: i) Planning and coordination of teaching theory as well as practical subjects. ii) Scheduling home assignments, quizzes, tutorials, etc. iii
UG Ordinance manual RGIPT-Final.pdf|58|b) Question paper should be designed in a manner that it contain the questions of varying difficulty levels. For example: Paper should have the fair balance of questions containing direct question/ lo
UG Ordinance manual RGIPT-Final.pdf|59|v) Evaluation of Answer books and preparation of final marks list and submission of grades to the Examination Section, Office of Dean (Academic Affairs). * If only one teacher is involved in teaching,
UG Ordinance manual RGIPT-Final.pdf|60|the examinations should be held during the periods/days specified in the Academic Calendar. b) Make-up Examinations: If a student, for cogent reasons such as illness, etc., fails to appear in the mid-
UG Ordinance manual RGIPT-Final.pdf|61|6.4 Grading System a) Grades and Grade Points At the end of the semester/summer term, a student is awarded a letter grade in each of his/her courses by the concerned course convener taking into accoun
UG Ordinance manual RGIPT-Final.pdf|62|The grades are submitted in the undergraduate office within the prescribed time limit after the end semester examination as prescribed by DOAA office. Normally, these are 72, 96 and 120 hrs for studen
UG Ordinance manual RGIPT-Final.pdf|63|converted into S or X after completion. Courses such as Physical Education, Modules on Literature, Social Sciences, and English etc will carry “S” (If satisfactory) or “X” (If unsatisfactory) Grade. I
UG Ordinance manual RGIPT-Final.pdf|64|examination shall be conducted and the grade I shall be replaced by the grade obtained by the student. An I grade must be converted by the convener/teacher to a regular letter grade by the last date f
UG Ordinance manual RGIPT-Final.pdf|65|Affairs) Office. A student getting F or X grade in a course must repeat it or replace it (if it is an elective). If the Course happens to be an Elective, he/she can substitute the same by another Elec
UG Ordinance manual RGIPT-Final.pdf|66|X --- (Research Unit) Unsatisfactory I --- Incomplete Z 0 Deregistered from the Course b) Absolute grading system is followed in case of the UG projects. The details of Marks secured and the correspon
UG Ordinance manual RGIPT-Final.pdf|67|unless the request is made by the course convener and is approved by the Chairman, Senate. Any such request for change of grade must, however, be made within six weeks of the start of the next semeste
UG Ordinance manual RGIPT-Final.pdf|68|1 2 3 4 5 (C G)  ( C G ) (C G ) (C G ) (C G ) SPI  1 1 2 2 3 3 4 4 5 5 C  C  C  C C 1 2 3 4 5 S and X grades and associated credits shall not be considered in the computation of the SPI.
UG Ordinance manual RGIPT-Final.pdf|69|replaces the old letter grade in the computation of the CPI, but, both the grades appear on his/her Grade Report. d) Grade Report - A Provisional Semester Grade Report is issued to each student at the
UG Ordinance manual RGIPT-Final.pdf|70|7. INADEQUATE ACADEMIC PERFORMANCE The academic performance of each undergraduate student is reviewed by Academic Performance Evaluation Committee (APEC) at the end of a semester/ term and is consider
UG Ordinance manual RGIPT-Final.pdf|71|degree of inadequacy, a deficient student may be placed on Warning or Academic Probation, or his/her academic programme may be terminated. 7.1 Warning A student is placed on Warning if his/her earned 
UG Ordinance manual RGIPT-Final.pdf|72|i) He/She shall register for the courses for which he/she failed in an appropriate semester to earn the pass credits, ii) He/She shall not hold any office in the Hostel, Students Councils or any other
UG Ordinance manual RGIPT-Final.pdf|73|b) Earned semester credits < 30% of the total semester credits at the end of the given semester. Such a student is required to sign an undertaking before the registration incorporating the following t
UG Ordinance manual RGIPT-Final.pdf|74|a) is on Academic Probation and his cumulative earned credits < 40% of the normal cumulative credits at the end of summer term of the given academic year. b) is absent without authorized leave of abse
UG Ordinance manual RGIPT-Final.pdf|75|Affairs Committee (S-SAC)/ a special Institute committee makes a recommendation to that effect. For students in the termination list after the end of their first year, may be given an option to repeat
UG Ordinance manual RGIPT-Final.pdf|76|appointed by the senate under the chairmanship of Dean (Academic Affairs) may be formed to take a final decision after considering all the available inputs. However, no further appeal for review will 
UG Ordinance manual RGIPT-Final.pdf|77|specified in the Academic Calendar. 8.2 Temporary Withdrawal / Semester Leave A student is not normally allowed to withdraw from the academic programme temporarily. He/she is expected to complete his/
UG Ordinance manual RGIPT-Final.pdf|78|in automatic withdrawal from all courses in that semester. A student who remains on authorized leave of absence due to ill health is required to submit a certificate from a Registered Medical Practiti
UG Ordinance manual RGIPT-Final.pdf|79|given below may spend up to two semesters and/or two summer terms in any academic institution of repute in India or abroad with prior permission of Dean (Academic Affairs). a) i) Completion of first f
UG Ordinance manual RGIPT-Final.pdf|80|the proposed programme is of a suitable nature, both in quality and quantity. On the recommendation of the DUGC, Dean (Academic Affairs) may approve the proposal and grant permission, with leave of ab
UG Ordinance manual RGIPT-Final.pdf|81|may apply for waiver with an official transcript of the grades obtained by him/her at the selected institution as a non-degree student and other documents/material that the concerned DUGC may require 
UG Ordinance manual RGIPT-Final.pdf|82|requirement for which a waiver is granted, a ‘T’ would appear on the Grade Report with an explanatory note that it stands for waiver granted due to courses taken and/or work done at the selected insti
UG Ordinance manual RGIPT-Final.pdf|83|for the normal academic load of courses during a semester. The minimum duration and maximum limit of residence for completion of various undergraduate programmes are: Minimum Duration Maximum Limit of
UG Ordinance manual RGIPT-Final.pdf|84|a) met the residence and academic requirements outlined in Sections 9.1 and 9.2; b) satisfied additional requirements, if any, of the concerned department, c) paid all dues to the Institute and the ho
UG Ordinance manual RGIPT-Final.pdf|85|the Senate to continue depending on the merits of the case. Page | 21 10. DEGREES 10.1 Award of Degrees A student who completes all the graduation requirements specified in Section 9.3 is recommended 
UG Ordinance manual RGIPT-Final.pdf|86|regarding recommendations for the award of the different types of scholarships, stipends, medals and prizes available to Institute students. It also coordinates and reviews the application of the poli
UG Ordinance manual RGIPT-Final.pdf|87|These scholarships, etc. are liable to be withdrawn, partially or wholly, in case of misconduct, deliberate concealment of material, facts and/or giving false information. A student leaving the Instit
UG Ordinance manual RGIPT-Final.pdf|88|approval of the Board of Governors. 12. CONDUCT AND DISCIPLINE 12.1 Code of Conduct Each student shall conduct himself/herself in a manner befitting his/her association with an Institute of national i
UG Ordinance manual RGIPT-Final.pdf|89|conduct (both within and outside the Institute), willful damage and/or removal of Institute property or belongings of fellow students, disturbing others in their studies, adoption of unfair means duri
UG Ordinance manual RGIPT-Final.pdf|90|punishment such as reprimand, disciplinary probation, fine, debarring from examinations, withdrawal of scholarship and/or placement services, withholding of grades and/or degrees, cancellation of regi
UG Ordinance manual RGIPT-Final.pdf|91| All cases of use of unfair practices during examination may be reported by the invigilator/course convener or any person to the Dean (Academic Affairs) for consideration.  In the event of detection
UG Ordinance manual RGIPT-Final.pdf|92|record purposes and provide another answer book to write the remaining answers  The Examination incharge shall submit the (1) report by the invigilators on alleged use of unfair mean, (2) documentary
UG Ordinance manual RGIPT-Final.pdf|93|student as elaborated in Table below. Nature of Unfair Mean End Semester Examination Mid Semester Examination Theory Practical Smuggling of answer Fail grade (F) in all Fail grade (F) in Zero marks in
UG Ordinance manual RGIPT-Final.pdf|94|examinations; fail subsequent grade in all theory examinations subjects zero marks in all subjects of the examination Found in possession of  Warning Fail grade (F) in  Warning written materials  f
UG Ordinance manual RGIPT-Final.pdf|95|invigilator Impersonation Fail grade (F) in all “F” grade in that Zero marks in all theory subjects of the subject and subjects of examination and disciplinary action examination and disciplinary acti
UG Ordinance manual RGIPT-Final.pdf|96|of suitable punishment.  The recommendation of the UMC shall be presented before the Director for approval. The Director on his/her wisdom or discretion may reduce or pardon the student. In such case
UG Ordinance manual RGIPT-Final.pdf|97|student, teacher or other functionary of the Institute. Further, in very exceptional circumstances, the Chairman, Senate may appoint a special committee to investigate and/or Page | 24 recommend appro
UG Ordinance manual RGIPT-Final.pdf|98|reconsideration of the decision. The Senate may not recommend a student, who is found guilty of some major offence, a degree/diploma/certificate even if he/she has satisfactorily completed all the aca
UG Ordinance manual RGIPT-Final.pdf|99|undergraduate programmes. Page | 25 Appendix 1 RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY Academic Calendar-YYYY-YY Event Odd Even Summer Registration of II-Vth Year UG & old PG Registration of ot
UG Ordinance manual RGIPT-Final.pdf|100|exam Last date for submission of grades of make-up exams and Conversion of ‘I’ grades Authentication of grades Vacation Page | 26 Appendix 2 Rules and Procedures for Change of Discipline for students 
UG Ordinance manual RGIPT-Final.pdf|101|change at RGIPT is described below; A. Guidelines for Change of Discipline Student will be allowed change of programme on the basis of his/her academic performance subject to strength constraints of t
UG Ordinance manual RGIPT-Final.pdf|102|a) The student should have passed all 1st Semester courses and her/his SPI at the end of 1st Semester should be 8.0. b) The merit of the students will be determined on the basis of Performance Index (
UG Ordinance manual RGIPT-Final.pdf|103|As many programme changes as possible will be granted in decreasing order of Performance Index (PI) to applicants, subject to eligibility and strength constraints of the programmes. In case of a tie, 
UG Ordinance manual RGIPT-Final.pdf|104|of the 2nd Semester should be  8.0. Page | 27 b) The merit of the students will be determined on the basis of Performance Index (PI) calculated on the basis of grades of the Institute Science and th
UG Ordinance manual RGIPT-Final.pdf|105|As many programme changes as possible will be granted in decreasing order of Performance Index (PI) to applicants, subject to eligibility and strength constraints of the programmes. In case of a tie, 
UG Ordinance manual RGIPT-Final.pdf|106|The change of discipline/branch will be there from one discipline to another within their respective programmes only i.e. the students of 4-year programmes may change disciplines within 4-year program
UG Ordinance manual RGIPT-Final.pdf|107|the students also serve the breadth requirement for their programme may allow waiver on case to case basis. In addition, if change of discipline has been permitted in the 3rd semester, the student wil
UG Ordinance manual RGIPT-Final.pdf|108|extra hours with books and other reading material or do assignment or prepare term paper. Problem solving in tutorials also be such that one hour/ tutorial hour home work is to be done by the student.
UG Ordinance manual RGIPT-Final.pdf|109|Thus C = L + T + P + SS (2L + T) = 3L + 2T + P Nature of Courses: 1. Courses with lecture component only; no need of extra contact for solutions of problems based on the subject taught. Contact hours 
UG Ordinance manual RGIPT-Final.pdf|110|Credits C = P. 6. Projects, Training will also earn credits as practical. However, the credits may be assigned considering the magnitude of work not with the hour spent. Page | 29 Confidential Appendi
UG Ordinance manual RGIPT-Final.pdf|111|_____________________________________________________________________________________________________________ __________________________________________________________________________________________
UG Ordinance manual RGIPT-Final.pdf|112|____________________________________________ Signature of Dean (Academic Affairs) Dated ________________________ Approved / Not approved ___________________________________ Signature of Chairman, Sena